#pragma once
#include <d3d11.h>

namespace game
{
	// https://github.com/rlabrecque/SteamworksSDK/tree/f4d127e335a66a1615c0870830d14dcee76ed8aa/public/steam

	struct raw_steam_id final
	{
		unsigned int account_id : 32;
		unsigned int account_instance : 20;
		unsigned int account_type : 4;
		int universe : 8;
	};

	typedef union
	{
		raw_steam_id raw;
		unsigned long long bits;
	} steam_id;

	struct ISteamUser;

	enum { k_iSteamUserCallbacks = 100 };
	enum { k_iSteamGameServerCallbacks = 200 };
	enum { k_iSteamFriendsCallbacks = 300 };
	enum { k_iSteamBillingCallbacks = 400 };
	enum { k_iSteamMatchmakingCallbacks = 500 };
	enum { k_iSteamContentServerCallbacks = 600 };
	enum { k_iSteamUtilsCallbacks = 700 };
	enum { k_iSteamAppsCallbacks = 1000 };
	enum { k_iSteamUserStatsCallbacks = 1100 };
	enum { k_iSteamNetworkingCallbacks = 1200 };
	enum { k_iSteamNetworkingSocketsCallbacks = 1220 };
	enum { k_iSteamNetworkingMessagesCallbacks = 1250 };
	enum { k_iSteamNetworkingUtilsCallbacks = 1280 };
	enum { k_iSteamRemoteStorageCallbacks = 1300 };
	enum { k_iSteamGameServerItemsCallbacks = 1500 };
	enum { k_iSteamGameCoordinatorCallbacks = 1700 };
	enum { k_iSteamGameServerStatsCallbacks = 1800 };
	enum { k_iSteam2AsyncCallbacks = 1900 };
	enum { k_iSteamGameStatsCallbacks = 2000 };
	enum { k_iSteamHTTPCallbacks = 2100 };
	enum { k_iSteamScreenshotsCallbacks = 2300 };
	enum { k_iSteamStreamLauncherCallbacks = 2600 };
	enum { k_iSteamControllerCallbacks = 2800 };
	enum { k_iSteamUGCCallbacks = 3400 };
	enum { k_iSteamStreamClientCallbacks = 3500 };
	enum { k_iSteamMusicCallbacks = 4000 };
	enum { k_iSteamGameNotificationCallbacks = 4400 };
	enum { k_iSteamHTMLSurfaceCallbacks = 4500 };
	enum { k_iSteamVideoCallbacks = 4600 };
	enum { k_iSteamInventoryCallbacks = 4700 };
	enum { k_ISteamParentalSettingsCallbacks = 5000 };
	enum { k_iSteamGameSearchCallbacks = 5200 };
	enum { k_iSteamPartiesCallbacks = 5300 };
	enum { k_iSteamSTARCallbacks = 5500 };
	enum { k_iSteamRemotePlayCallbacks = 5700 };
	enum { k_iSteamChatCallbacks = 5900 };
	enum { k_iSteamTimelineCallbacks = 6000 };

	typedef unsigned __int64 SteamAPICall_t;
	typedef unsigned __int8 uint8;
	typedef unsigned __int16 uint16;
	typedef unsigned __int32 uint32;
	typedef unsigned __int64 uint64;

	struct LobbyDataUpdate_t
	{
		enum { k_iCallback = k_iSteamMatchmakingCallbacks + 5 };

		uint64 m_ulSteamIDLobby;		// steamID of the Lobby
		uint64 m_ulSteamIDMember;		// steamID of the member whose data changed, or the room itself
		uint8 m_bSuccess;				// true if we lobby data was successfully changed; 
		// will only be false if RequestLobbyData() was called on a lobby that no longer exists
	};

	struct LobbyMatchList_t
	{
		enum { k_iCallback = k_iSteamMatchmakingCallbacks + 10 };
		unsigned int num_lobbies;		// Number of lobbies that matched search criteria and we have SteamIDs for
	};

	class CCallbackBase
	{
	public:
		CCallbackBase() { m_nCallbackFlags = 0; m_iCallback = 0; }
		// don't add a virtual destructor because we export this binary interface across dll's
		virtual void Run(void* pvParam) = 0;
		virtual void Run(void* pvParam, bool bIOFailure, SteamAPICall_t hSteamAPICall) = 0;
		int GetICallback() { return m_iCallback; }
		virtual int GetCallbackSizeBytes() = 0;

	protected:
		enum { k_ECallbackFlagsRegistered = 0x01, k_ECallbackFlagsGameServer = 0x02 };
		uint8 m_nCallbackFlags;
		int m_iCallback;
		friend class CCallbackMgr;

	private:
		CCallbackBase(const CCallbackBase&);
		CCallbackBase& operator=(const CCallbackBase&);
	};

	struct LobbyEnter_t
	{
		enum { k_iCallback = k_iSteamMatchmakingCallbacks + 4 };

		steam_id lobby_id;
		int permissions;
		bool locked;
		int chatroom;
	};

	struct /*VFT*/ ISteamUser_vtbl
	{
		int(__fastcall* GetHSteamUser)(ISteamUser* this_);
		bool(__fastcall* LoggedOn)(ISteamUser* this_);
		__int64(__fastcall* GetSteamID)(ISteamUser* this_, steam_id* steamIDUser);
		int(__fastcall* InitiateGameConnection)(ISteamUser* this_, void* pAuthBlob, int cbMaxAuthBlob, steam_id steamIDGameServer, unsigned int unIPServer, unsigned __int16 usPortServer, bool bSecure);
		void(__fastcall* TerminateGameConnection)(ISteamUser* this_, unsigned int unIPServer, unsigned __int16 usPortServer);
		void(__fastcall* TrackAppUsageEvent)(ISteamUser* this_, steam_id gameID, int eAppUsageEvent, const char* pchExtraInfo);
		bool(__fastcall* GetUserDataFolder)(ISteamUser* this_, char* pchBuffer, int cubBuffer);
		void(__fastcall* StartVoiceRecording)(ISteamUser* this_);
		void(__fastcall* StopVoiceRecording)(ISteamUser* this_);
		int(__fastcall* GetAvailableVoice)(ISteamUser* this_, unsigned int* pcbCompressed, unsigned int* pcbUncompressed, unsigned int nUncompressedVoiceDesiredSampleRate);
		int(__fastcall* GetVoice)(ISteamUser* this_, bool bWantCompressed, void* pDestBuffer, unsigned int cbDestBufferSize, unsigned int* nBytesWritten, bool bWantUncompressed, void* pUncompressedDestBuffer, unsigned int cbUncompressedDestBufferSize, unsigned int* nUncompressBytesWritten, unsigned int nUncompressedVoiceDesiredSampleRate);
		int(__fastcall* DecompressVoice)(ISteamUser* this_, void* pCompressed, unsigned int cbCompressed, void* pDestBuffer, unsigned int cbDestBufferSize, unsigned int* nBytesWritten);
		unsigned int(__fastcall* GetVoiceOptimalSampleRate)(ISteamUser* this_);
		unsigned int(__fastcall* GetAuthSessionTicket)(ISteamUser* this_, void* pTicket, int cbMaxTicket, unsigned int* pcbTicket);
		int(__fastcall* BeginAuthSession)(ISteamUser* this_, const void* pAuthTicket, int cbAuthTicket, steam_id steamID);
		void(__fastcall* EndAuthSession)(ISteamUser* this_, steam_id steamID);
		void(__fastcall* CancelAuthTicket)(ISteamUser* this_, unsigned int hAuthTicket);
		unsigned int(__fastcall* UserHasLicenseForApp)(ISteamUser* this_, steam_id steamID, unsigned int appID);
		bool(__fastcall* BIsBehindNAT)(ISteamUser* this_);
		void(__fastcall* AdvertiseGame)(ISteamUser* this_, steam_id steamIDGameServer, unsigned int unIPServer, unsigned __int16 usPortServer);
		unsigned __int64(__fastcall* RequestEncryptedAppTicket)(ISteamUser* this_, void* pUserData, int cbUserData);
		bool(__fastcall* GetEncryptedAppTicket)(ISteamUser* this_, void* pTicket, int cbMaxTicket, unsigned int* pcbTicket);
	};

	struct ISteamUser
	{
		ISteamUser_vtbl* __vftable /*VFT*/;
	};

	struct ISteamNetworking;

	struct /*VFT*/ ISteamNetworking_vtbl
	{
		bool(__fastcall* SendP2PPacket)(ISteamNetworking* this_, steam_id steamIDRemote, const void* pubData, unsigned int cubData, int eP2PSendType, int nChannel);
		bool(__fastcall* IsP2PPacketAvailable)(ISteamNetworking* this_, unsigned int* pcubMsgSize, int nChannel);
		bool(__fastcall* ReadP2PPacket)(ISteamNetworking* this_, void* pubDest, unsigned int cubDest, unsigned int* pcubMsgSize, steam_id* psteamIDRemote, int nChannel);
		bool(__fastcall* AcceptP2PSessionWithUser)(ISteamNetworking* this_, steam_id steamIDRemote);
		bool(__fastcall* CloseP2PSessionWithUser)(ISteamNetworking* this_, steam_id steamIDRemote);
		bool(__fastcall* CloseP2PChannelWithUser)(ISteamNetworking* this_, steam_id steamIDRemote, int iVirtualPort);
		bool(__fastcall* GetP2PSessionState)(ISteamNetworking* this_, steam_id steamIDRemote, void* pConnectionState);
		bool(__fastcall* AllowP2PPacketRelay)(ISteamNetworking* this_, bool bAllow);
		unsigned int(__fastcall* CreateListenSocket)(ISteamNetworking* this_, int nVirtualP2PPort, unsigned int nIP, unsigned __int16 nPort, bool bAllowUseOfPacketRelay);
		unsigned int(__fastcall* CreateP2PConnectionSocket)(ISteamNetworking* this_, steam_id steamIDTarget, int nVirtualPort, int nTimeoutSec, bool bAllowUseOfPacketRelay);
		unsigned int(__fastcall* CreateConnectionSocket)(ISteamNetworking* this_, unsigned int nIP, unsigned __int16 nPort, int nTimeoutSec);
		bool(__fastcall* DestroySocket)(ISteamNetworking* this_, unsigned int hSocket, bool bNotifyRemoteEnd);
		bool(__fastcall* DestroyListenSocket)(ISteamNetworking* this_, unsigned int hSocket, bool bNotifyRemoteEnd);
		bool(__fastcall* SendDataOnSocket)(ISteamNetworking* this_, unsigned int hSocket, void* pubData, unsigned int cubData, bool bReliable);
		bool(__fastcall* IsDataAvailableOnSocket)(ISteamNetworking* this_, unsigned int hSocket, unsigned int* pcubMsgSize);
		bool(__fastcall* RetrieveDataFromSocket)(ISteamNetworking* this_, unsigned int hSocket, void* pubDest, unsigned int cubDest, unsigned int* pcubMsgSize);
		bool(__fastcall* IsDataAvailable)(ISteamNetworking* this_, unsigned int hListenSocket, unsigned int* pcubMsgSize, unsigned int* phSocket);
		bool(__fastcall* RetrieveData)(ISteamNetworking* this_, unsigned int hListenSocket, void* pubDest, unsigned int cubDest, unsigned int* pcubMsgSize, unsigned int* phSocket);
		bool(__fastcall* GetSocketInfo)(ISteamNetworking* this_, unsigned int hSocket, steam_id* pSteamIDRemote, int* peSocketStatus, unsigned int* punIPRemote, unsigned __int16* punPortRemote);
		bool(__fastcall* GetListenSocketInfo)(ISteamNetworking* this_, unsigned int hListenSocket, unsigned int* pnIP, unsigned __int16* pnPort);
		int(__fastcall* GetSocketConnectionType)(ISteamNetworking* this_, unsigned int hSocket);
		int(__fastcall* GetMaxPacketSize)(ISteamNetworking* this_, unsigned int hSocket);
	};

	struct ISteamNetworking
	{
		ISteamNetworking_vtbl* __vftable /*VFT*/;
	};

	struct ISteamFriends;

	typedef std::int16_t FriendsGroupID_t;

	struct /*VFT*/ ISteamFriends_vtbl
	{
		const char* (__fastcall* GetPersonaName)(ISteamFriends* this_);
		unsigned __int64(__fastcall* SetPersonaName)(ISteamFriends* this_, const char* pchPersonaName);
		int(__fastcall* GetPersonaState)(ISteamFriends* this_);
		int(__fastcall* GetFriendCount)(ISteamFriends* this_, int eFriendFlags);
		void(__fastcall* GetFriendByIndex)(ISteamFriends* this_, steam_id* out, int iFriend, int iFriendFlags);
		int(__fastcall* GetFriendRelationship)(ISteamFriends* this_, steam_id steamIDFriend);
		int(__fastcall* GetFriendPersonaState)(ISteamFriends* this_, steam_id steamIDFriend);
		const char* (__fastcall* GetFriendPersonaName)(ISteamFriends* this_, steam_id steamIDFriend);
		bool(__fastcall* GetFriendGamePlayed)(ISteamFriends* this_, steam_id steamIDFriend, void* pFriendGameInfo);
		const char* (__fastcall* GetFriendPersonaNameHistory)(ISteamFriends* this_, steam_id steamIDFriend, int iPersonaName);
		int(__fastcall* GetFriendSteamLevel)(ISteamFriends* this_, steam_id steamIDFriend);
		const char* (__fastcall* GetPlayerNickname)(ISteamFriends* this_, steam_id steamIDFriend);
		int(__fastcall* GetFriendsGroupCount)(ISteamFriends* this_);
		FriendsGroupID_t(__fastcall* GetFriendsGroupIDByIndex)(ISteamFriends* this_, int iFG);
		const char* (__fastcall* GetFriendsGroupName)(ISteamFriends* this_, FriendsGroupID_t friendsGroupID);
		int(__fastcall* GetFriendsGroupMembersCount)(ISteamFriends* this_, FriendsGroupID_t friendsGroupID);
		void(__fastcall* GetFriendsGroupMembersList)(ISteamFriends* this_, FriendsGroupID_t friendsGroupID, steam_id* pOutSteamIDMembers, int nMembersCount);
		bool(__fastcall* HasFriend)(ISteamFriends* this_, steam_id steamIDFriend, int eFriendFlags);
		int(__fastcall* GetClanCount)(ISteamFriends* this_);
		steam_id(__fastcall* GetClanByIndex)(ISteamFriends* this_, int iClan);
		const char* (__fastcall* GetClanName)(ISteamFriends* this_, steam_id steamIDClan);
		const char* (__fastcall* GetClanTag)(ISteamFriends* this_, steam_id steamIDClan);
		bool(__fastcall* GetClanActivityCounts)(ISteamFriends* this_, steam_id steamID, int* pnOnline, int* pnInGame, int* pnChatting);
		unsigned __int64(__fastcall* DownloadClanActivityCounts)(ISteamFriends* this_, steam_id groupIDs[], int nIds);
		int(__fastcall* GetFriendCountFromSource)(ISteamFriends* this_, steam_id steamIDSource);
		steam_id(__fastcall* GetFriendFromSourceByIndex)(ISteamFriends* this_, steam_id steamIDSource, int iFriend);
		bool(__fastcall* IsUserInSource)(ISteamFriends* this_, steam_id steamIDUser, steam_id steamIDSource);
		void(__fastcall* SetInGameVoiceSpeaking)(ISteamFriends* this_, steam_id steamIDUser, bool bSpeaking);
		void(__fastcall* ActivateGameOverlay)(ISteamFriends* this_, const char* pchDialog);
		void(__fastcall* ActivateGameOverlayToUser)(ISteamFriends* this_, const char* pchDialog, steam_id steamID);
		void(__fastcall* ActivateGameOverlayToWebPage)(ISteamFriends* this_, const char* pchURL);
		void(__fastcall* ActivateGameOverlayToStore)(ISteamFriends* this_, unsigned int nAppID, unsigned int eFlag);
		void(__fastcall* SetPlayedWith)(ISteamFriends* this_, steam_id steamIDUserPlayedWith);
		void(__fastcall* ActivateGameOverlayInviteDialog)(ISteamFriends* this_, steam_id steamIDLobby);
		int(__fastcall* GetSmallFriendAvatar)(ISteamFriends* this_, steam_id steamIDFriend);
		int(__fastcall* GetMediumFriendAvatar)(ISteamFriends* this_, steam_id steamIDFriend);
		int(__fastcall* GetLargeFriendAvatar)(ISteamFriends* this_, steam_id steamIDFriend);
		bool(__fastcall* RequestUserInformation)(ISteamFriends* this_, steam_id steamIDUser, bool bRequireNameOnly);
		unsigned __int64(__fastcall* RequestClanOfficerList)(ISteamFriends* this_, steam_id steamIDClan);
		steam_id(__fastcall* GetClanOwner)(ISteamFriends* this_, steam_id steamIDClan);
		int(__fastcall* GetClanOfficerCount)(ISteamFriends* this_, steam_id steamIDClan);
		steam_id(__fastcall* GetClanOfficerByIndex)(ISteamFriends* this_, steam_id steamIDClan, int iOfficer);
		int(__fastcall* GetUserRestrictions)(ISteamFriends* this_);
		bool(__fastcall* SetRichPresence)(ISteamFriends* this_, const char* pchKey, const char* pchValue);
		void(__fastcall* ClearRichPresence)(ISteamFriends* this_);
		const char* (__fastcall* GetFriendRichPresence)(ISteamFriends* this_, steam_id steamIDFriend, const char* pchKey);
		int(__fastcall* GetFriendRichPresenceKeyCount)(ISteamFriends* this_, steam_id steamIDFriend);
		const char* (__fastcall* GetFriendRichPresenceKeyByIndex)(ISteamFriends* this_, steam_id steamIDFriend, int iKey);
		void(__fastcall* RequestFriendRichPresence)(ISteamFriends* this_, steam_id steamIDFriend);
		bool(__fastcall* InviteUserToGame)(ISteamFriends* this_, steam_id steamIDFriend, const char* pchConnectString);
		int(__fastcall* GetCoplayFriendCount)(ISteamFriends* this_);
		steam_id(__fastcall* GetCoplayFriend)(ISteamFriends* this_, int iCoplayFriend);
		int(__fastcall* GetFriendCoplayTime)(ISteamFriends* this_, steam_id steamIDFriend);
		unsigned int(__fastcall* GetFriendCoplayGame)(ISteamFriends* this_, steam_id steamIDFriend);
		unsigned __int64(__fastcall* JoinClanChatRoom)(ISteamFriends* this_, steam_id steamIDClan);
		bool(__fastcall* LeaveClanChatRoom)(ISteamFriends* this_, steam_id steamIDClan);
		int(__fastcall* GetClanChatMemberCount)(ISteamFriends* this_, steam_id steamIDClan);
		steam_id(__fastcall* GetChatMemberByIndex)(ISteamFriends* this_, steam_id steamIDClan, int iUser);
		bool(__fastcall* SendClanChatMessage)(ISteamFriends* this_, steam_id steamIDClanChat, const char* pchText);
		int(__fastcall* GetClanChatMessage)(ISteamFriends* this_, steam_id steamIDClanChat, int iMessage, void* prgchText, int cchTextMax, unsigned int* peChatEntryType, steam_id* pSteamIDChatter);
		bool(__fastcall* IsClanChatAdmin)(ISteamFriends* this_, steam_id steamIDClanChat, steam_id steamIDUser);
		bool(__fastcall* IsClanChatWindowOpenInSteam)(ISteamFriends* this_, steam_id steamIDClanChat);
		bool(__fastcall* OpenClanChatWindowInSteam)(ISteamFriends* this_, steam_id steamIDClanChat);
		bool(__fastcall* CloseClanChatWindowInSteam)(ISteamFriends* this_, steam_id steamIDClanChat);
		bool(__fastcall* SetListenForFriendsMessages)(ISteamFriends* this_, bool bInterceptEnabled);
		bool(__fastcall* ReplyToFriendMessage)(ISteamFriends* this_, steam_id steamIDFriend, const char* pchMsgToSend);
		int(__fastcall* GetFriendMessage)(ISteamFriends* this_, steam_id steamIDFriend, int iMessageID, void* pvData, int cubData, unsigned int* peChatEntryType);
		unsigned __int64(__fastcall* GetFollowerCount)(ISteamFriends* this_, steam_id steamID);
		unsigned __int64(__fastcall* IsFollowing)(ISteamFriends* this_, steam_id steamID);
		unsigned __int64(__fastcall* EnumerateFollowingList)(ISteamFriends* this_, unsigned int unStartIndex);
	};

	struct ISteamFriends
	{
		ISteamFriends_vtbl* __vftable /*VFT*/;
	};

	struct LobbyCreated_t
	{
		enum { k_iCallback = k_iSteamMatchmakingCallbacks + 13 };
		int result;
		steam_id lobby_id;
	};

	struct LobbyChatMsg_t
	{
		steam_id lobby_id;
		steam_id user_id;
		std::uint8_t chat_entry_type;
		std::uint32_t chat_id;
	};

	static_assert(offsetof(LobbyChatMsg_t, chat_id) == 20);

	struct ISteamMatchmaking;

	struct /*VFT*/ ISteamMatchmaking_vtbl
	{
		int(__fastcall* GetFavoriteGameCount)(ISteamMatchmaking* this_);
		bool(__fastcall* GetFavoriteGame)(ISteamMatchmaking* this_, int iGame, unsigned int* pnAppID, unsigned int* pnIP, unsigned __int16* pnConnPort, unsigned __int16* pnQueryPort, unsigned int* punFlags, unsigned int* pRTime32LastPlayedOnServer);
		int(__fastcall* AddFavoriteGame)(ISteamMatchmaking* this_, unsigned int nAppID, unsigned int nIP, unsigned __int16 nConnPort, unsigned __int16 nQueryPort, unsigned int unFlags, unsigned int rTime32LastPlayedOnServer);
		bool(__fastcall* RemoveFavoriteGame)(ISteamMatchmaking* this_, unsigned int nAppID, unsigned int nIP, unsigned __int16 nConnPort, unsigned __int16 nQueryPort, unsigned int unFlags);
		unsigned __int64(__fastcall* RequestLobbyList)(ISteamMatchmaking* this_);
		void(__fastcall* AddRequestLobbyListStringFilter)(ISteamMatchmaking* this_, const char* pchKeyToMatch, const char* pchValueToMatch, int eComparisonType);
		void(__fastcall* AddRequestLobbyListNumericalFilter)(ISteamMatchmaking* this_, const char* pchKeyToMatch, int nValueToMatch, int eComparisonType);
		void(__fastcall* AddRequestLobbyListNearValueFilter)(ISteamMatchmaking* this_, const char* pchKeyToMatch, int nValueToBeCloseTo);
		void(__fastcall* AddRequestLobbyListFilterSlotsAvailable)(ISteamMatchmaking* this_, int nSlotsAvailable);
		void(__fastcall* AddRequestLobbyListDistanceFilter)(ISteamMatchmaking* this_, int eLobbyDistanceFilter);
		void(__fastcall* AddRequestLobbyListResultCountFilter)(ISteamMatchmaking* this_, int cMaxResults);
		void(__fastcall* AddRequestLobbyListCompatibleMembersFilter)(ISteamMatchmaking* this_, steam_id steamID);
		steam_id*(__fastcall* GetLobbyByIndex)(ISteamMatchmaking* this_, steam_id* lobby_id, int iLobby);
		unsigned __int64(__fastcall* CreateLobby)(ISteamMatchmaking* this_, int eLobbyType, int cMaxMembers);
		unsigned __int64(__fastcall* JoinLobby)(ISteamMatchmaking* this_, steam_id steamIDLobby);
		void(__fastcall* LeaveLobby)(ISteamMatchmaking* this_, steam_id steamIDLobby);
		bool(__fastcall* InviteUserToLobby)(ISteamMatchmaking* this_, steam_id steamIDLobby, steam_id steamIDInvitee);
		int(__fastcall* GetNumLobbyMembers)(ISteamMatchmaking* this_, steam_id steamIDLobby);
		void(__fastcall* GetLobbyMemberByIndex)(ISteamMatchmaking* this_, steam_id* steamIDUser, steam_id steamIDLobby, int iMember);
		const char* (__fastcall* GetLobbyData)(ISteamMatchmaking* this_, steam_id steamIDLobby, const char* pchKey);
		bool(__fastcall* SetLobbyData)(ISteamMatchmaking* this_, steam_id steamIDLobby, const char* pchKey, const char* pchValue);
		int(__fastcall* GetLobbyDataCount)(ISteamMatchmaking* this_, steam_id steamIDLobby);
		bool(__fastcall* GetLobbyDataByIndex)(ISteamMatchmaking* this_, steam_id steamIDLobby, int iLobbyData, char* pchKey, int cchKeyBufferSize, char* pchValue, int cchValueBufferSize);
		bool(__fastcall* DeleteLobbyData)(ISteamMatchmaking* this_, steam_id steamIDLobby, const char* pchKey);
		const char* (__fastcall* GetLobbyMemberData)(ISteamMatchmaking* this_, steam_id steamIDLobby, steam_id steamIDUser, const char* pchKey);
		void(__fastcall* SetLobbyMemberData)(ISteamMatchmaking* this_, steam_id steamIDLobby, const char* pchKey, const char* pchValue);
		bool(__fastcall* SendLobbyChatMsg)(ISteamMatchmaking* this_, steam_id steamIDLobby, const void* pvMsgBody, int cubMsgBody);
		int(__fastcall* GetLobbyChatEntry)(ISteamMatchmaking* this_, steam_id steamIDLobby, int iChatID, steam_id* pSteamIDUser, void* pvData, int cubData, int* peChatEntryType);
		bool(__fastcall* RequestLobbyData)(ISteamMatchmaking* this_, steam_id steamIDLobby);
		void(__fastcall* SetLobbyGameServer)(ISteamMatchmaking* this_, steam_id steamIDLobby, unsigned int unGameServerIP, unsigned __int16 unGameServerPort, steam_id steamIDGameServer);
		bool(__fastcall* GetLobbyGameServer)(ISteamMatchmaking* this_, steam_id steamIDLobby, unsigned int* punGameServerIP, unsigned __int16* punGameServerPort, steam_id* psteamIDGameServer);
		bool(__fastcall* SetLobbyMemberLimit)(ISteamMatchmaking* this_, steam_id steamIDLobby, int cMaxMembers);
		int(__fastcall* GetLobbyMemberLimit)(ISteamMatchmaking* this_, steam_id steamIDLobby);
		bool(__fastcall* SetLobbyType)(ISteamMatchmaking* this_, steam_id steamIDLobby, int eLobbyType);
		bool(__fastcall* SetLobbyJoinable)(ISteamMatchmaking* this_, steam_id steamIDLobby, bool bLobbyJoinable);
		steam_id*(__fastcall* GetLobbyOwner)(ISteamMatchmaking* this_, steam_id* owner, steam_id steamIDLobby);
		bool(__fastcall* SetLobbyOwner)(ISteamMatchmaking* this_, steam_id steamIDLobby, steam_id steamIDNewOwner);
		bool(__fastcall* SetLinkedLobby)(ISteamMatchmaking* this_, steam_id steamIDLobby, steam_id steamIDLobby2);
	};

	struct ISteamMatchmaking
	{
		ISteamMatchmaking_vtbl* __vftable /*VFT*/;
	};

	namespace Json
	{
		struct Value
		{
			char __pad0[24];
		};
	}

	namespace lua
	{
		struct lua_State
		{

		};
	}

	namespace tpp::ui::menu
	{
		struct UiCommonDataManager;
	}

	namespace gn
	{
		struct Buffer
		{
			char* data;
			unsigned int size;
		};
	}

	namespace Vectormath::Aos
	{
		struct Vector2
		{
			union
			{
				float values[2];
			};
		};

		struct Vector3
		{
			union
			{
				float values[4];
				__m128 value;
			};
		};

		struct Vector4
		{
			union
			{
				float values[4];
				__m128 value;
			};
		};

		struct Quat
		{
			float values[4];
		};
	}

	namespace fox
	{
		struct Rgba8;
		struct Path;

		struct SharedStringData
		{
			const char* buffer;
		};

		struct SharedString
		{
			SharedStringData* data;
		};

		struct String : SharedString
		{

		};

		struct pfimpl
		{
			__int32 refCount;
			__int32 pad;
		};

		struct SharedObject
		{
			struct vtable
			{
				void(__fastcall* __destructor)(SharedObject*);
				void(__fastcall* Release)(SharedObject*);
			};
			vtable* __vftable;
			pfimpl pf;
		};

		struct Quark
		{
			struct vtable
			{
				void(__fastcall* __destructor)(fox::Quark*);
				void(__fastcall* Initialize)(fox::Quark*);
				void(__fastcall* Terminate)(fox::Quark*);
				void(__fastcall* GetInterface)(fox::Quark*);
				void(__fastcall* CancelPermit)(fox::Quark*);
				void(__fastcall* GetCreator)(fox::Quark*);
			};

			vtable* __vftable;
			void* a1;
			void* a3;
			void* a4;
		};

		union Color
		{
			float values[4];
			__m128 value;
		};

		struct Buffer
		{
			char* data;
			char* a2;
			size_t offset;
			size_t size;
			size_t capacity;
			int flags;
		};

		static_assert(offsetof(Buffer, data) == 0);
		static_assert(offsetof(Buffer, size) == 24);
		static_assert(offsetof(Buffer, capacity) == 32);
		static_assert(offsetof(Buffer, flags) == 40);
		static_assert(sizeof(Buffer) == 0x30);

		struct RawKeyboardData
		{
			__int16 makeCode;
			char __pad0[2];
			int key;
			__int16 keyAscii;
			__int16 keyUnicode;
			bool isUp;
			bool unk;
		};

#pragma pack(push, 1)
		struct RawMouseData
		{
			int buttonStates;
			int buttonsDown;
			int buttonsUp;
			__int16 pointX;
			__int16 pointY;
			__int16 deltaX;
			__int16 deltaY;
			__int16 lastX;
			__int16 lastY;
			int buttonData;
		};
#pragma pack(pop)

		struct LuaBase
		{
			struct vftable
			{
				void(__fastcall* __destructor)();
			};

			vftable* __vftable;
			lua::lua_State* state;
			char initialized;
		};

		struct Lua : LuaBase
		{
			struct vftable
			{
				void(__fastcall* __destructor)();
			};

			void* a2;
			void* queue;
		};

		struct LuaAutoPtr
		{
			fox::Lua* lua;
			int top;
			int a2;
		};

		struct HashMapBase
		{
			char __pad0[48];
		};

		namespace gk
		{
#pragma pack(push, 1)
			struct FirstPartyAccount
			{
				unsigned __int64 id;
				char name[129];
			};
#pragma pack(pop)
		}

		namespace gr
		{
			struct Scene;

			struct SceneObject;
			struct SceneObject
			{
				struct vtable
				{
					void* f[64];
				};
				vtable* __vftable;
				char __pad0[8];
				SceneObject* obj1;
				SceneObject* obj2;
				__int64 flags1;
				int priority;
				char __pad2[4];
				Scene* scene;
				short unk;
				short flags2;
				char __pad3[64];
			};

			struct SceneObjectList
			{
				SceneObject* obj1;
				SceneObject* obj2;
				int count;
			};

			struct Scene
			{
				Scene* next;
				int index;
				int flags;
				char __pad1[16];
				SharedString id;
				char __pad2[8];
				fox::gr::SceneObjectList** objectList1;
				fox::gr::SceneObjectList* objectList2;
				char __pad3[16];
				void* lock;
			};

			struct Draw2D
			{
				struct vtable
				{

				};

				vtable* __vftable;
				char __pad0[16];
				Draw2D* next;
				char __pad1[8];
				int priority;
				char __pad2[36];
				int flags;
				char __pad3[8];
			};

			struct ResourceId
			{
				union
				{
					struct
					{
						unsigned int type : 7;
						unsigned int unk2 : 10;
						unsigned int index : 15;
					} fields;
					unsigned int data;
				};
			};

			struct Texture
			{
				char __pad0[24];
				ResourceId id;
			};

			namespace dg
			{
				struct StringFontMetricsCache
				{
					char a1;
					char a2;
					__int16 count;
					int stringWidth;
					__int16* glyphs;
				};

				struct _TextureGlyphData
				{
					float a1;
					float a2;
					char a3_1;
					char a3_2;
					char a3_3;
					char a3_4;
					char a4_1;
					char a4_2;
					char a4_3;
					char a4_4;
					float a5;
					float a6;
					float a7;
					float a8;
				};

				struct ImageGlyphManager
				{
					char __pad0[8];
					_TextureGlyphData* imageGlyphs;
					fox::HashMapBase hashMap;
					char __pad1[24];
					int numGlyphs;
					int numUnk;
					char __pad2[256];
				};

				struct FontSystem_unk1
				{
					char __pad0[10];
					char c1;
					char __pad1[53];
					__int16 s1;
					char c2;
				};

				struct FontSystem_unk2
				{
					char __pad0[72];
					ImageGlyphManager* imageGlyphManager;
				};

				struct FontSystem
				{
					char __pad0[8];
					void* ptr_array1[9];
					fox::gr::dg::FontSystem_unk1* unk1;
					fox::gr::dg::FontSystem_unk2* unk2;
				};

				struct DynamicVertexBuffer_unk1
				{
					char __pad0[20];
					int count;
				};

				struct DynamicVertexBuffer
				{
					char __pad0[64];
					DynamicVertexBuffer_unk1* unk1;
					char __pad1[8];
					gn::Buffer* buffer;
					char __pad2[16];
					void* ptr1;
					unsigned int a1;
					unsigned int a2;
				};

				struct SubCommandContext
				{

				};

				struct BuildDraw2DParameters
				{
					char __pad0[8];
					Draw2D** drawList;
					SubCommandContext* commandContext;
					DynamicVertexBuffer* vertexBuffer;
					void* ptr2;
					void* ptr3;
					void* ptr4;
					char __pad1[4];
					float f1;
					int viewX;
					int viewY;
					int viewWidth;
					int viewHeight;
				};

				struct FontTextureMetrics
				{
					float f1;
					float f2;
					float f3;
					float f4;
					float f5;
					float f6;
					float f7;
					float f8;
					float f9;
				};

				struct DgTextureStreamer
				{

				};

				struct ShadowConstantRegister
				{

				};

				struct CommandBuffer
				{
					char __pad0[40];
					fox::gr::dg::ShadowConstantRegister* shadowConstantRegister;
					char __pad1[16];
					fox::gr::ResourceId material;
					char __pad2[556];
				};

				struct MaterialResource_unk1
				{
					union
					{
						struct
						{
							unsigned char textureCount1 : 4;
							unsigned char textureCount2 : 4;
						} fields;
						unsigned char data;
					};
				};

				struct MaterialResource
				{
					char __pad0[32];
					fox::gr::ResourceId shader;
					unsigned char numConsts;
					fox::gr::dg::MaterialResource_unk1 unkFields;
					char __pad2[10];
					float consts[8][4];
					fox::gr::ResourceId textures[8];
				};

				struct MaterialManager
				{
					struct vtable
					{

					};

					vtable* __vftable;
					fox::gr::dg::MaterialResource* materials;
				};

				struct ShaderTechnique
				{
					char __pad0[80];
				};

				struct ShaderTechniqueManager
				{
					struct vtable
					{

					};

					vtable* __vftable;
					ShaderTechnique* shaderTechniques;
				};

				namespace plugins
				{
					struct Draw2DRenderer_unk
					{
						unsigned char flags1[8];
						char __pad0[112];
						unsigned int flags2;
						unsigned int flags3;
					};

					struct Draw2DRenderer
					{
						char __pad0[720];
						Vectormath::Aos::Vector4 viewVec1;
						Vectormath::Aos::Vector4 viewVec2;
						BuildDraw2DParameters* parameters;
						CommandBuffer* commandBuffer;
						Draw2DRenderer_unk* unk;
						char __pad1[16];
						fox::gr::ResourceId shader;
						gn::Buffer* buffer;
						unsigned int size;
						char __pad2[14];
						char unk1;
						char __pad3[5];
						DynamicVertexBuffer* vertexBuffer;
						void* ptr1;
						char __pad4[92];
						_TextureGlyphData* glyphData;
					};

					static_assert(offsetof(Draw2DRenderer, glyphData) == 0x3B0);
				}
			}

			struct Packet2D
			{
				Packet2D(unsigned char type_, unsigned char size_)
					: type(type_), size(size_)
				{
				}

				template <typename T>
				T* next()
				{
					return reinterpret_cast<T*>(reinterpret_cast<size_t>(this) + this->size);
				}

				unsigned char type{};
				unsigned char flags{};
				unsigned short size{};
			};

			struct Packet2DBuffer
			{
				void* a1;
				void* a2;
				Packet2D* packet;
				void* a4;
				int packetSize;
				int flags;
				int a6;
			};

			struct _fp16
			{
				unsigned short v[4];
			};

			struct Material
			{
				struct vtable
				{
					void(__fastcall* __destructor)(Material*, char);
				};

				vtable* __vftable;
				int unk;
				char __pad0[4];
				game::fox::gr::ResourceId resource;
			};

			static_assert(offsetof(Material, resource) == 0x10);

			struct MaterialParameter
			{

			};

			struct Packet2DLine : Packet2D
			{
				Packet2DLine() : Packet2D(1, 24) {}
				char __pad0[20]{};
			};

			struct Packet2DTriangle : Packet2D
			{
				Packet2DTriangle() : Packet2D(2, 36) {}
				char __pad0[32]{};
			};

			struct Packet2DQuad : Packet2D
			{
				Packet2DQuad() : Packet2D(3, 44) {}
				char __pad0[40]{};
			};

			struct Packet2DBox : Packet2D
			{
				Packet2DBox() : Packet2D(4, 20) {}
				unsigned int color{};
				unsigned __int16 f1{};
				unsigned __int16 f2{};
				unsigned __int16 f3{};
				unsigned __int16 f4{};
				unsigned __int16 f5{};
			};

			struct Packet2DSprite : Packet2D
			{
				Packet2DSprite() : Packet2D(5, 28) {}
				char __pad0[24]{};
			};

			struct Packet2DSprite2D : Packet2D
			{
				Packet2DSprite2D() : Packet2D(6, 32) {}
				char __pad0[28]{};
			};

			struct Packet2DRSprite : Packet2D
			{
				Packet2DRSprite() : Packet2D(7, 28) {}
				char __pad0[24]{};
			};

			struct Packet2DString : Packet2D
			{
				Packet2DString() : Packet2D(8, 32) {}
				fox::gr::dg::StringFontMetricsCache* fontMetricsCache{};
				unsigned short glyphUnk{};
				unsigned short glyphHeight{};
				unsigned short glyphWidth{};
				unsigned short flags{};
				unsigned int fontType{};
				unsigned short glyphSpacing{};
				unsigned short a9{};
			};

			struct Packet2DString2D : Packet2D
			{
				Packet2DString2D() : Packet2D(9, 48) {}
				char __pad0[44]{};
			};

			struct Packet2DCube : Packet2D
			{
				Packet2DCube() : Packet2D(10, 28) {}
				char __pad0[24]{};
			};

			struct Packet2DLineStrip : Packet2D
			{
				Packet2DLineStrip() : Packet2D(11, 8) {}
				char __pad0[4]{};
			};

			struct Packet2DVertex : Packet2D
			{
				Packet2DVertex() : Packet2D(0, 16) {}
				unsigned int color{};
				unsigned short v[5]{};
			};

			template <size_t Count>
			struct Packet2DTriangleStrip : Packet2D
			{
				Packet2DTriangleStrip() : Packet2D(12, 8)
				{
					this->size += Count * sizeof(Packet2DVertex);
				}
				int count = Count;
				Packet2DVertex vertices[Count]{};
			};

			struct Packet2DViewport : Packet2D
			{
				Packet2DViewport() : Packet2D(13, 12) {}
				_fp16 v{};
			};

			struct Packet2DViewmap : Packet2D
			{
				Packet2DViewmap() : Packet2D(14, 28) {}
				float v[3][3]{};
			};

			struct Packet2DWorldCoords : Packet2D
			{
				Packet2DWorldCoords() : Packet2D(15, 4) {}
			};

			struct Packet2DScreenCoords : Packet2D
			{
				Packet2DScreenCoords() : Packet2D(16, 4) {}
			};

			struct Packet2DMatrix : Packet2D
			{
				Packet2DMatrix() : Packet2D(17, 44) {}
				float v1[3]{};
				float v2[3]{};
				float quat[4]{};
			};

			struct Packet2DRotation : Packet2D
			{
				Packet2DRotation() : Packet2D(18, 20) {}
				float quat[4]{};
			};

			struct Packet2DTranslation : Packet2D
			{
				Packet2DTranslation() : Packet2D(19, 16) {}
				float x{};
				float y{};
				float z{};
			};

			struct Packet2DScale : Packet2D
			{
				Packet2DScale() : Packet2D(20, 16) {}
				float x{};
				float y{};
				float z{};
			};

			struct Packet2DBillboard : Packet2D
			{
				Packet2DBillboard() : Packet2D(21, 8) {}
				float f1{};
				float f2{};
			};

			struct Packet2DPerspective : Packet2D
			{
				Packet2DPerspective() : Packet2D(22, 24) {}
				float f1{};
				float f2{};
				float f3{};
				float f4{};
				float f5{};
			};

			struct Packet2DFlat : Packet2D
			{
				Packet2DFlat() : Packet2D(23, 4) {}
			};

			struct Packet2DDepthMode : Packet2D
			{
				Packet2DDepthMode() : Packet2D(24, 4) {}
			};

			struct Packet2DCullMode : Packet2D
			{
				Packet2DCullMode() : Packet2D(25, 4) {}
			};

			struct Packet2DTexture : Packet2D
			{
				Packet2DTexture() : Packet2D(26, 8) {}
				int id{};
			};

			struct Packet2DAlpha : Packet2D
			{
				Packet2DAlpha() : Packet2D(27, 4) {}
			};

			struct Packet2DColor : Packet2D
			{
				Packet2DColor() : Packet2D(28, 12) {}
				_fp16 rgba{};
			};

			struct Packet2DStencil : Packet2D
			{
				Packet2DStencil() : Packet2D(29, 16) {}
				unsigned char a1{};
				unsigned char a2{};
				unsigned char a3{};
				unsigned char a4{};
				unsigned char a5{};
				unsigned char a6{};
				unsigned char a7{};
				unsigned char a8{};
				int a9{};
			};

			struct Packet2DClearStencil : Packet2D
			{
				Packet2DClearStencil() : Packet2D(30, 8) {}
				int a1{};
			};

			struct Packet2DMaterial : Packet2D
			{
				Packet2DMaterial() : Packet2D(32, 16) {}
				Material* material{};
			};

			struct Packet2DMaterialWork : Packet2D
			{
				Packet2DMaterialWork() : Packet2D(33, 24) {}
				char __pad0[20]{};
			};

			struct Packet2DUserMatrix : Packet2D
			{
				Packet2DUserMatrix() : Packet2D(34, 68) {}
				char __pad0[64]{};
			};

			struct Packet2DPush : Packet2D
			{
				Packet2DPush() : Packet2D(38, 4) {}
			};

			struct Packet2DPop : Packet2D
			{
				Packet2DPop() : Packet2D(39, 4) {}
			};

			struct Packet2DResolve : Packet2D
			{
				Packet2DResolve() : Packet2D(40, 8) {}
				char __pad0[4]{};
			};

			struct Packet2DCopyRenderTarget : Packet2D
			{
				Packet2DCopyRenderTarget() : Packet2D(41, 12) {}
				char __pad0[8]{};
			};

			struct Packet2DDrawIndices : Packet2D
			{
				Packet2DDrawIndices() : Packet2D(45, 24) {}
				char __pad0[20]{};
			};

			struct Packet2DUserVertexBuffer : Packet2D
			{
				Packet2DUserVertexBuffer() : Packet2D(46, 24) {}
				char __pad0[20]{};
			};

			struct Packet2DBeginRenderToTemporary : Packet2D
			{
				Packet2DBeginRenderToTemporary() : Packet2D(47, 16) {}
				char __pad0[12]{};
			};

			struct Packet2DEndRenderToTemporary : Packet2D
			{
				Packet2DEndRenderToTemporary() : Packet2D(48, 4) {}
			};

			struct Packet2DSetTemporaryTexture : Packet2D
			{
				Packet2DSetTemporaryTexture() : Packet2D(49, 8) {}
				char __pad0[4]{};
			};

		}

		namespace impl
		{
			struct TimeSystemImpl;

			struct TimeSystemImpl_vtbl
			{
				unsigned __int64(__fastcall* GetCurrentTickTime)(TimeSystemImpl* this_);
				double(__fastcall* GetSecondWithTickTime)(TimeSystemImpl* this_, __int64);
				double(__fastcall* GetSecond)(TimeSystemImpl* this_);
				unsigned __int64(__fastcall* GetTickTimeFrequency)(TimeSystemImpl* this_);
				void(__fastcall* __destructor)(TimeSystemImpl* this_);
			};

			struct TimeSystemImpl
			{
				TimeSystemImpl_vtbl* __vftable;
				char __pad0[8];
				double deltaGameTime;
				char __pad1[8];
				double gameTimeRate;
				double frameTime;
				double elapsedTimeSinceStartup;
				int frameIndex;
			};

			static_assert(offsetof(TimeSystemImpl, deltaGameTime) == 16);
			static_assert(offsetof(TimeSystemImpl, gameTimeRate) == 32);
			static_assert(offsetof(TimeSystemImpl, frameTime) == 40);
			static_assert(offsetof(TimeSystemImpl, elapsedTimeSinceStartup) == 48);
			static_assert(offsetof(TimeSystemImpl, frameIndex) == 56);

		}

		struct StringId_fields
		{
			std::uint32_t l;
			std::uint32_t h;
		};

		struct StringId
		{
			union
			{
				StringId_fields f;
				std::uint64_t id;
			};
		};

		struct Path
		{
			__int64 id;
		};

		struct KernelString
		{
			const char* buffer;
			__int64 unk1;
			__int64 unk2;
			__int64 unk3;
		};

		struct PathId
		{
			std::uint64_t id;
		};

		typedef std::uint32_t KeyCode;

		namespace uix
		{
			struct PrefabRecordCallFunc;
		}

		namespace ui
		{
			struct LineDraw;

			struct SoundControl;

			struct TextUnit
			{
				char* text;
				unsigned int a2;
				unsigned int flags;
				unsigned __int16 textLength;
				unsigned __int16 a5;
				float textWidth;
				float textHeight;
				unsigned int paletteColor;
			};

			static_assert(offsetof(TextUnit, textWidth) == 20);
			static_assert(offsetof(TextUnit, textHeight) == 24);
			static_assert(offsetof(TextUnit, paletteColor) == 28);

			struct ModelNode
			{

			};

			struct ModelNodeText;

			struct ModelNodeText_vtbl
			{
				void(__fastcall* __destructor)(ModelNodeText*);
				void(__fastcall* GetPacketBuffer)(ModelNodeText*);
				void(__fastcall* InitializePacketBuffer)(ModelNodeText*);
				void(__fastcall* ReleasePacketBuffer)(ModelNodeText*);
				void(__fastcall* UpdatePacket)(ModelNodeText*);
				void* (__fastcall* GetBoundingBox)(ModelNodeText*);
				void(__fastcall* nullsub1)(ModelNodeText*);
				void(__fastcall* nullsub2)(ModelNodeText*);
				void(__fastcall* nullsub3)(ModelNodeText*);
			};

#pragma pack(push, 1)
			struct ModelNodeText
			{
				fox::ui::ModelNodeText_vtbl* __vftable;
				char __pad0[106];
				char f0;
				char __pad1[21];
				void* f1;
				short flags;
				char enableTextScroll;
				char __pad2[1];
				int f4;
				void* f5;
				void* f6;
				void* f7;
				void* f8;
				int f9;
				int f10;
				int packetBufferSize;
				char __pad3[4];
				fox::gr::Packet2DBuffer* packetBuffer;
				void* f12;
				char textAlign;
				char f13;
				char f14;
				char f15;
				short f16;
				char __pad4[2];
				float displayAreaOffsetX;
				float displayAreaOffsetY;
				float displayAreaWidth;
				float displayAreaHeight;
				Vectormath::Aos::Vector4 displaySizes;
				void* f20;
				int f21;
				char __pad5[4];
				void* f22;
				void* f23;
				int f24;
				char __pad6[4];
				void* f25;
				void* f26;
				fox::ui::TextUnit* textUnit;
				int f28;
				char __pad7[4];
				void* f29;
				void* f30;
				int lineWidthsCount;
				int f31;
				float* lineWidths;
				int lineHeightsCount;
				int f33;
				float* lineHeights;
				float lineHeight;
				float lineWidth;
				void* f36;
				void* f37;
				void* f38;
				void* f39;
				void* f40;
				void* f41;
				float scrollSpeed;
				float textOffsetX;
				int textScrollUnk2;
				int textScrollUnk3;
			};
#pragma pack(pop)

			static_assert(offsetof(fox::ui::ModelNodeText, __pad0) == 8);
			static_assert(offsetof(fox::ui::ModelNodeText, f0) == 114);
			static_assert(offsetof(fox::ui::ModelNodeText, __pad1) == 115);
			static_assert(offsetof(fox::ui::ModelNodeText, f1) == 136);
			static_assert(offsetof(fox::ui::ModelNodeText, flags) == 144);
			//static_assert(offsetof(fox::ui::ModelNodeText, f3) == 146);
			static_assert(offsetof(fox::ui::ModelNodeText, __pad2) == 147);
			static_assert(offsetof(fox::ui::ModelNodeText, f4) == 148);
			static_assert(offsetof(fox::ui::ModelNodeText, f5) == 152);
			static_assert(offsetof(fox::ui::ModelNodeText, f6) == 160);
			static_assert(offsetof(fox::ui::ModelNodeText, f7) == 168);
			static_assert(offsetof(fox::ui::ModelNodeText, f8) == 176);
			static_assert(offsetof(fox::ui::ModelNodeText, f9) == 184);
			static_assert(offsetof(fox::ui::ModelNodeText, f10) == 188);
			static_assert(offsetof(fox::ui::ModelNodeText, __pad3) == 196);
			static_assert(offsetof(fox::ui::ModelNodeText, packetBuffer) == 200);
			static_assert(offsetof(fox::ui::ModelNodeText, f12) == 208);
			//static_assert(offsetof(fox::ui::ModelNodeText, f13) == 216);
			static_assert(offsetof(fox::ui::ModelNodeText, f14) == 218);
			static_assert(offsetof(fox::ui::ModelNodeText, f15) == 219);
			static_assert(offsetof(fox::ui::ModelNodeText, f16) == 220);
			static_assert(offsetof(fox::ui::ModelNodeText, __pad4) == 222);
			static_assert(offsetof(fox::ui::ModelNodeText, f20) == 256);
			static_assert(offsetof(fox::ui::ModelNodeText, f21) == 264);
			static_assert(offsetof(fox::ui::ModelNodeText, __pad5) == 268);
			static_assert(offsetof(fox::ui::ModelNodeText, f22) == 272);
			static_assert(offsetof(fox::ui::ModelNodeText, f23) == 280);
			static_assert(offsetof(fox::ui::ModelNodeText, f24) == 288);
			static_assert(offsetof(fox::ui::ModelNodeText, __pad6) == 292);
			static_assert(offsetof(fox::ui::ModelNodeText, f25) == 296);
			static_assert(offsetof(fox::ui::ModelNodeText, f26) == 304);
			static_assert(offsetof(fox::ui::ModelNodeText, textUnit) == 312);
			static_assert(offsetof(fox::ui::ModelNodeText, f28) == 320);
			static_assert(offsetof(fox::ui::ModelNodeText, __pad7) == 324);
			static_assert(offsetof(fox::ui::ModelNodeText, f29) == 328);
			static_assert(offsetof(fox::ui::ModelNodeText, f30) == 336);
			//static_assert(offsetof(fox::ui::ModelNodeText, f35) == 376);
			static_assert(offsetof(fox::ui::ModelNodeText, f36) == 384);
			static_assert(offsetof(fox::ui::ModelNodeText, f37) == 392);
			static_assert(offsetof(fox::ui::ModelNodeText, f38) == 400);
			static_assert(offsetof(fox::ui::ModelNodeText, f39) == 408);
			static_assert(offsetof(fox::ui::ModelNodeText, f40) == 416);
			static_assert(offsetof(fox::ui::ModelNodeText, f41) == 424);
			//static_assert(offsetof(fox::ui::ModelNodeText, f42) == 432);
			//static_assert(offsetof(fox::ui::ModelNodeText, f43) == 440);

			static_assert(sizeof(ModelNodeText) == 0x1C0);

			struct ModelNodeLine
			{

			};

			struct ModelNodeMesh
			{

			};

			struct Model;

			struct ComponentTraversalInfo;


			struct Model
			{
				struct vtable
				{
					void* (__fastcall* Model)(fox::ui::Model* this_, void*, unsigned int);
					void* (__fastcall* Release)(fox::ui::Model* this_, void*);
					void* (__fastcall* GetComponentInfo)(fox::ui::Model* this_, fox::ui::ModelNode const*);
					void* (__fastcall* GetModelNodeCommon1)(fox::ui::Model* this_, unsigned int);
					void* (__fastcall* GetModelNodeCommon2)(fox::ui::Model* this_, fox::StringId);
					void* (__fastcall* SetupDrawPriority)(fox::ui::Model* this_, char);
					void* (__fastcall* GetType)(fox::ui::Model* this_);
					void* (__fastcall* EnableScaleInheritance)(fox::ui::Model* this_);
					void* (__fastcall* EnableRotationInheritance)(fox::ui::Model* this_);
					void* (__fastcall* EnableTranslationInheritance)(fox::ui::Model* this_);
					void* (__fastcall* EnableColorRGBInheritance)(fox::ui::Model* this_);
					void* (__fastcall* EnableColorAlphaInheritance)(fox::ui::Model* this_);
					void* (__fastcall* DisableScaleInheritance)(fox::ui::Model* this_);
					void* (__fastcall* DisableRotationInheritance)(fox::ui::Model* this_);
					void* (__fastcall* DisableTranslationInheritance)(fox::ui::Model* this_);
					void* (__fastcall* DisableColorRGBInheritance)(fox::ui::Model* this_);
					void* (__fastcall* DisableColorAlphaInheritance)(fox::ui::Model* this_);
					void* (__fastcall* SetTranslate)(fox::ui::Model* this_, Vectormath::Aos::Vector3*);
					void* (__fastcall* SetScale)(fox::ui::Model* this_, Vectormath::Aos::Vector3*);
					void* (__fastcall* SetQuaternion)(fox::ui::Model* this_, Vectormath::Aos::Quat*);
					void* (__fastcall* SetColor)(fox::ui::Model* this_, fox::Color*);
					void* (__fastcall* SetVisible)(fox::ui::Model* this_, bool);
					void* (__fastcall* GetTranslate)(fox::ui::Model* this_);
					void* (__fastcall* GetScale)(fox::ui::Model* this_);
					void* (__fastcall* GetQuaternion)(fox::ui::Model* this_);
					void* (__fastcall* GetColor)(fox::ui::Model* this_);
					void* (__fastcall* GetVisible)(fox::ui::Model* this_);
					void* (__fastcall* IsInitialized)(fox::ui::Model* this_);
					void* (__fastcall* UpdateComponent)(fox::ui::Model* this_, fox::ui::ComponentTraversalInfo*);
					void* (__fastcall* GetWorldTransform)(fox::ui::Model* this_, fox::ui::ModelNode const*, fox::ui::ComponentTraversalInfo*);
					void* (__fastcall* GetDrawPriorityForChild)(fox::ui::Model* this_);
					void* (__fastcall* IsValid)(fox::ui::Model* this_);
				};

				vtable* __vftable;
				char __pad0[24];
				int id;
				char __pad1[156];
				__int64 sceneName;
				fox::gr::Draw2D* draw2d;
				void* unk;
				fox::gr::Packet2DBuffer* packetBuffer;
				char __pad2[24];
			};

			struct WindowInterface;
			struct TriggerPool;
			struct LayoutComponent;
			struct Layout;
			struct GraphState;

			struct ModelNodeCommon
			{
				char __pad0[108];
				std::uint32_t hash;
			};

			struct Animation;

			struct Font
			{
				char __pad0[8];
				fox::gr::Texture* texture;
				char __pad1[64];
			};

			struct RawDaemon
			{

			};

			struct FontManager
			{
				struct FontGroup
				{
					Font* font;
					float width;
					float height;
					float spacing;
					float f3;
					float f4;
					char __pad0[16];
				};
			};
		}

		namespace math
		{
			struct Vector2
			{
				float x;
				float y;
			};
		}

		namespace nio
		{
			struct Object_vtbl;

#pragma pack(push, 4)
			struct Object
			{
				Object_vtbl* __vftable;
				std::uint32_t a2;
				std::uint32_t a3;
				std::uint32_t a4;
			};
#pragma pack(pop)

			template <typename T>
			struct ObjectPtr
			{
				T* ptr;
			};

			struct MpSocket
			{

			};

			namespace impl
			{
				struct SppSocketImpl_mgo
				{
					char __pad1[248];
					int error;
					char __pad2[280];
					__int16 next_seq;
					__int16 last_seq;
					__int8 a2;
					__int8 a3;
					__int8 error_count;
					char __pad3[85];
					void* a1;
					char __pad4[4728];
					int rtt_time;
				};

				struct SppSocketImpl_tpp
				{
					char __pad0[5336];
					int rtt_time;
				};

				union SppSocketImpl
				{
					SppSocketImpl_tpp tpp;
					SppSocketImpl_mgo mgo;
				};
			}
		};

		template <typename T>
		struct EntityPtrBase
		{
			T* ptr;
		};

		struct EntityHandle
		{
			void* a1;
		};

		template <typename T>
		struct Array
		{
			std::uint32_t size;
			std::uint32_t capacity;
			T** array;
		};

		namespace nt
		{
			struct SessionUserId;

			struct SessionUserId_vtbl
			{

			};

			struct SessionUserId
			{
				SessionUserId_vtbl* __vftable;
				void* a1;
				std::uint64_t userId;
			};

			struct SteamSessionUserId;

			struct SteamSessionUserId_vtbl
			{

			};

			struct SteamSessionUserId
			{
				SteamSessionUserId_vtbl* __vftable;
				std::uint8_t type;
				std::uint64_t userId;
			};

			static_assert(sizeof(SteamSessionUserId) == 0x18);

			struct Member;

			struct Member_SessionInterface;

			struct Member_SessionInterface_vtbl
			{
				int(__fastcall* GetIndex)(Member* this_);
				void* (__fastcall* GetIntAnimationController)(Member* this_);
				void(__fastcall* GetSessionIdString)(Member* this_, char*, void*);
				void(__fastcall* __destructor)(Member* this_);
			};

			struct Member_SessionInterface
			{
				Member_SessionInterface_vtbl* __vftable;
			};

			struct Member
			{
				fox::nio::Object object;
				fox::nt::Member_SessionInterface sessionInterface;
				void* a1;
				char index;
				fox::nio::impl::SppSocketImpl* sppSocket;
				void* sPtr2;
				std::uint8_t a5;
				int flags;
				fox::Array<fox::EntityHandle> entityHandles;
				fox::Array<fox::nio::ObjectPtr<fox::nio::MpSocket>> mpSockets;
				void* syncActivator;
				fox::nt::SteamSessionUserId* sessionUserId;
				void* sPtr3;
			};

			static_assert(offsetof(Member, sessionUserId) == 0x70);
			static_assert(sizeof(Member) == 0x80);

			struct Group
			{
				Member** members;
				void* a2;
				void* a3;
				unsigned int size;
			};

			namespace impl
			{
				struct SessionIdle;

				struct SessionIdle_vtbl
				{

				};

				struct SessionIdle_SessionInterface;

				struct SessionIdle_SessionInterface_vtbl
				{

				};

				struct SessionIdle_SessionInterface
				{
					SessionIdle_SessionInterface_vtbl* __vftable;
				};

				struct SessionIdle_MpPortAllocator;

				struct SessionIdle_MpPortAllocator_vtbl
				{

				};

				struct SessionIdle_MpPortAllocator
				{
					SessionIdle_MpPortAllocator_vtbl* __vftable;
				};

				struct SessionIdle
				{
					SessionIdle_vtbl* __vftable;
					void* a2;
					void* a3;
					SessionIdle_MpPortAllocator* mpPortAllocator;
					SessionIdle_SessionInterface sessionInterface;
					SessionIdle* session1;
					void* a7;
					void* a8;
					void* a9;
					fox::nt::Member* hostMember;
					Group memberGroup1;
					Group memberGroup2;
					unsigned int a18_2;
					unsigned int flags;
					char sessionIndex;
					void* a20;
					int a21_1;
					int a21_2;
					void* a22;
					int a23_1;
					int a23_2;
					void* sPtr5;
					void* sPtr6;
					void* sPtr7;
					void* sPtr8;
					void* sPtr9;
					void* a29;
					void* a30;
					void* a31;
					void* a32;
				};

				struct SessionImpl2;

				struct SessionImpl2_vtbl_mgo
				{
					void* (__fastcall* __destructor)(SessionImpl2* this_);
					void(__fastcall* Release)(SessionImpl2* this_);
					unsigned int(__fastcall* GetState)(SessionImpl2* this_);
					Group* (__fastcall* GetPeerMembers)(SessionImpl2* this_);
					void(__fastcall* Initialize)(SessionImpl2* this_, void*);
					void(__fastcall* Terminate)(SessionImpl2* this_);
					Member* (__fastcall* GetLocalMember)(SessionImpl2* this_);
					Member* (__fastcall* GetHostMember)(SessionImpl2* this_);
					Member* (__fastcall* DeleteMember)(SessionImpl2* this_, Member* member);
					unsigned __int64(__fastcall* GetSppTimeInMsec)(SessionImpl2* this_);
					bool(__fastcall* IsEnabled)(SessionImpl2* this_);
					void(__fastcall* Close)(SessionImpl2* this_);
					void(__fastcall* SetHeartBeat)(SessionImpl2* this_, bool, float, float);
					void(__fastcall* PrepareP2PConnection)(SessionImpl2* this_, void* sessionReserveManager);
					void(__fastcall* Start)(SessionImpl2* this_);
					void(__fastcall* EnableAccept)(SessionImpl2* this_, bool);
					void(__fastcall* DisconnectPreparingMembers)(SessionImpl2* this_);
					void* (__fastcall* GetP2pConnectionManager)(SessionImpl2* this_);
					void(__fastcall* SetP2pConnectionManager)(SessionImpl2* this_, void*);
					void(__fastcall* FixFrameTime)(SessionImpl2* this_);
					void(__fastcall* Update)(SessionImpl2* this_);
					unsigned __int64(__fastcall* GetResult)(SessionImpl2* this_);
					void(__fastcall* InitAcceptedMember)(SessionImpl2* this_, void*, void*);
					Group* (__fastcall* GetAllMembers)(SessionImpl2* this_);
				};

				struct SessionImpl2_vtbl_tpp
				{
					void* (__fastcall* __destructor)(SessionImpl2* this_);
					void(__fastcall* Release)(SessionImpl2* this_);
					unsigned int(__fastcall* GetState)(SessionImpl2* this_);
					Group* (__fastcall* GetPeerMembers)(SessionImpl2* this_);
					void(__fastcall* Initialize)(SessionImpl2* this_, void*);
					void(__fastcall* Terminate)(SessionImpl2* this_);
					Member* (__fastcall* GetLocalMember)(SessionImpl2* this_);
					Member* (__fastcall* GetHostMember)(SessionImpl2* this_);
					Member* (__fastcall* DeleteMember)(SessionImpl2* this_, Member* member);
					unsigned __int64(__fastcall* GetSppTimeInMsec)(SessionImpl2* this_);
					bool(__fastcall* IsEnabled)(SessionImpl2* this_);
					void(__fastcall* SetHeartBeat)(SessionImpl2* this_, bool, float, float);
					void(__fastcall* PrepareP2PConnection)(SessionImpl2* this_, void* sessionReserveManager);
					void(__fastcall* Start)(SessionImpl2* this_);
					void(__fastcall* EnableAccept)(SessionImpl2* this_, bool);
					void(__fastcall* DisconnectPreparingMembers)(SessionImpl2* this_);
					void(__fastcall* FixFrameTime)(SessionImpl2* this_);
					void(__fastcall* Update)(SessionImpl2* this_);
					void* (__fastcall* GetP2pConnectionManager)(SessionImpl2* this_);
					unsigned __int64(__fastcall* GetResult)(SessionImpl2* this_);
					void(__fastcall* InitAcceptedMember)(SessionImpl2* this_, void*, void*);
					Group* (__fastcall* GetAllMembers)(SessionImpl2* this_);
				};

				union SessionImpl2_vtbl
				{
					SessionImpl2_vtbl_tpp tpp;
					SessionImpl2_vtbl_mgo mgo;
				};

				struct SessionImpl2_SessionInterface;

				struct SessionImpl2_SessionInterface_vtbl
				{
					void* (__fastcall* GetLocalMemberInterface)(SessionImpl2_SessionInterface* this_);
					void* (__fastcall* GetHostMemberInterface)(SessionImpl2_SessionInterface* this_);
					void* (__fastcall* GetMemberInterfaceAtIndex)(SessionImpl2_SessionInterface* this_, void*);
					int(__fastcall* GetMemberCount)(SessionImpl2_SessionInterface* this_);
					unsigned int(__fastcall* GetOriginalValueCount)(SessionImpl2_SessionInterface* this_);
					bool(__fastcall* IsHost)(SessionImpl2_SessionInterface* this_);
					unsigned int(__fastcall* GetInvisibleFlagOfDebugDraw)(SessionImpl2_SessionInterface* this_);
					bool(__fastcall* IsOnline)(SessionImpl2_SessionInterface* this_);
					void(__fastcall* PrepareP2PConnection)(SessionImpl2_SessionInterface* this_, void*);
					bool(__fastcall* IsConnecting)(SessionImpl2_SessionInterface* this_);
					unsigned int(__fastcall* GetLastError)(SessionImpl2_SessionInterface* this_);
					unsigned int(__fastcall* GetLastConnectionManagerError)(SessionImpl2_SessionInterface* this_);
					unsigned int(__fastcall* __destructor)(SessionImpl2_SessionInterface* this_);
				};

				struct SessionImpl2_SessionInterface
				{
					SessionImpl2_SessionInterface_vtbl* __vftable;
				};

				struct SessionImpl2_MpPortAllocator;

				struct SessionImpl2_MpPortAllocator_vtbl
				{

				};

				struct SessionImpl2_MpPortAllocator
				{
					SessionImpl2_MpPortAllocator_vtbl* __vftable;
				};

				struct SessionImpl2
				{
					fox::nt::impl::SessionImpl2_vtbl* __vftable /*VFT*/;
					void* a2;
					void* a3;
					fox::nt::impl::SessionImpl2_MpPortAllocator* mpPortAllocator;
					fox::nt::impl::SessionImpl2_SessionInterface sessionInterface;
					fox::nt::impl::SessionImpl2* session1;
					void* sPtr1;
					void* sPtr2;
					void* sPtr3;
					fox::nt::Member* hostMember;
					fox::nt::Group allMembers;
					fox::nt::Group peerMembers;
					unsigned int flags;
					char sessionIndex;
					void* a4;
					int a5;
					int a6;
					void* a7;
					int a8;
					int a9;
					fox::nio::impl::SppSocketImpl* sppSocket;
					void* sPtr6;
					void* sPtr7;
					void* sPtr8;
					void* sPtr9;
					char a10_1;
					char started;
					char acceptEnabled;
					char a10_4;
					int lastError;
				};

				static_assert(sizeof(SessionImpl2) == 232);
			}
		}
	
		namespace ncl
		{
#pragma pack(push, 8)
			struct NclMessageBase
			{
				struct vtable
				{
					void(__fastcall* __destructor)(fox::ncl::NclMessageBase*);
				};

				vtable* __vftable;
				fox::String msgid;
				int a1;
				int a2;
				fox::String crypto_type;
				fox::String str4;
			};

			struct NclJsonMessage
			{
				struct vtable
				{
					void(__fastcall* __destructor)(fox::ncl::NclJsonMessage*);
					__int64(__fastcall* Serialize)(fox::ncl::NclJsonMessage*, fox::Buffer*);
					__int64(__fastcall* Deserialize)(fox::ncl::NclJsonMessage*, fox::Buffer*);
					char(__fastcall* Pack)(fox::ncl::NclJsonMessage*);
					char(__fastcall* Unpack)(fox::ncl::NclJsonMessage*);
					int(__fastcall* meth_06)(fox::ncl::NclJsonMessage*);
				};

				vtable* __vftable;
				Json::Value json;
				fox::ncl::NclMessageBase base;
			};

			struct NclJsonMessageBase
			{
				struct vtable
				{
					void(__fastcall* __destructor)(fox::ncl::NclJsonMessageBase*);
				};

				vtable* __vftable;
				int rqid;
				NclJsonMessage jsonMessage;
			};

			struct NclJsonMessageResult : NclJsonMessageBase
			{
				struct vtable
				{

				};

				vtable* __vftable;
				fox::String result;
			};

			struct NclJsonMessageResult__shifted0x10
			{
				struct vtable
				{

				};

				NclJsonMessage jsonMessage;
				vtable* __vftable;
				fox::String result;
			};
#pragma pack(pop)

#pragma pack(push, 1)
			struct NclDaemon
			{
				char __pad0[56];
				char isLogin;
				char __pad1[7];
				fox::SharedString sessionKey;
				unsigned char key[16];
				char __pad2[96];
				fox::String ip1;
				fox::String ip2;
			};
#pragma pack(pop)

			static_assert(offsetof(NclDaemon, key) == 72);

			struct NclCryptBlowfish
			{
				struct vtable
				{

				};

				fox::ncl::NclCryptBlowfish::vtable* __vftable;
				char __pad0[4168];
			};

#pragma pack(push, 1)
			struct NclHttpCodec
			{
				struct vtable
				{
					void(__fastcall* __destructor)(fox::ncl::NclHttpCodec*);
					void(__fastcall* Release)(fox::ncl::NclHttpCodec*);
					void(__fastcall* SetMessage)(fox::ncl::NclHttpCodec*, fox::ncl::NclJsonMessageBase*, fox::ncl::NclJsonMessageResult*);
					void(__fastcall* Post)(fox::ncl::NclHttpCodec*);
				};

				fox::ncl::NclHttpCodec::vtable* __vftable;
				void* ptr1;
				fox::ncl::NclCryptBlowfish* blow;
				fox::ncl::NclJsonMessageBase* messageBase;
				fox::ncl::NclJsonMessageResult* messageResult;
				void* ptr5;
				void* callback;
				void* ptr7;
				void* ptr8;
				char a1;
				__int16 a2;
				char __pad0[5];
				void* ptr10;
				int a3;
				char __pad1[4];
				void* ptr12;
			};
#pragma pack(pop)
		}
	}

	union Session
	{
		fox::nt::impl::SessionImpl2* SessionImpl2;
		fox::nt::impl::SessionIdle* sessionIdle;
	};

	namespace tpp::ui
	{
		namespace menu
		{
			namespace impl
			{
				struct MenuSystemImpl
				{

				};
			}

			namespace mbm
			{
				namespace impl
				{
					struct FobMission2CallbackImpl
					{
						char __pad0[176];
						char state;
						char __pad1[11399];
						char currentTab;
						char hasLoadedTab[10];
						char __pad2[0x10000];
					};
				}
			}
		}
	}

	namespace tpp::mbm
	{
		struct PlayerBasicInfo
		{
			struct Emblem
			{
				unsigned int texture_tag[4];
				unsigned int base_color[4];
				unsigned int frame_color[4];
				char position_x[4];
				char position_y[4];
				char scale[4];
				char rotate[4];
			};

			struct Resource
			{
				int fuel_resource;
				int biotic_resource;
				int common_metal;
				int minor_metal;
				int precious_metal;
			};

			fox::gk::FirstPartyAccount owner_account;
			char owner_name[0x64];
			char __pad1[3];
			unsigned int owner_player_id;
			fox::gk::FirstPartyAccount attacker_account;
			char attacker_name[0x64];
			char __pad3[3];
			unsigned int attacker_player_id;
			unsigned int mother_base_id[4];
			int field4;
			int attack_count;
			int support_count2;
			short staff_num;
			char mother_base_num;
			char platform_count[4];
			char security_rank[4];
			char area_id[4];
			char construct_param2[4];
			int supported_count;
			int support_count1;
			int field7;
			int field8;
			int field9;
			int field10;
			int capture_staff;
			int capture_resource_count;
			int attack_gmp;
			int field14;
			int left_hour2;
			struct
			{
				char follow : 1;
				char follower : 1;
				char enemy : 1;
				char help : 1;
				char online : 1;
				char insurance : 1;
				char hero : 1;
				char unused : 1;
			} fields1;
			char sneak_rank_grade;
			char field18_1;
			char field19_1;
			int sneak_rank_rank;
			char attacker_sneak_rank_grade;
			char league_rank_grade;
			char field26_1;
			char field16_2;
			int league_rank_rank;
			char field21_2;
			char field22_2;
			char field23_2;
			char field24_2;
			char field25_2;
			char field26_2;
			short espionage_section;
			short espionage_win;
			short espionage_total;
			int espionage_score;
			short attacker_espionage_section;
			short attacker_espionage_win;
			short attacker_espionage_total;
			char field21_4;
			char field22_4;
			int attacker_espionage_score;
			char nuclear;
			char owner_ugc;
			char field27_3;
			char field27_4;
			Emblem owner_emblem;
			char attacker_ugc;
			char field43_2;
			char field43_3;
			char field43_4;
			Emblem attacker_emblem;
			__int64 field45;
			__int64 field47;
			int field49;
			char field50_1;
			char field50_2;
			char field50_3;
			char field50_4;
			Resource processing_resource;
			Resource usable_resource;
			Resource capture_resource;
			int field58;
			int field59;
			int field60;
			int field61;
			int field62;
			int field63;
			int field64;
			int field65;
			int field66;
			int field67;
			int field68;
			int field69;
			int field70;
			int field71;
			int field72;
			short staff_count[10];
			int date_time;
			char cluster;
			char field79_2;
			short capture_staff_count[10];
			short injury_staff_count[10];
			short field80;
			Resource capture_resource2;
			int capture_nuclear;
			char is_win;
			char field91_2;
			char nameplate_id;
			char field91_4;
		};

		static_assert(sizeof(PlayerBasicInfo) == 1000);
		static_assert(offsetof(PlayerBasicInfo, owner_name) == 0x89);
		static_assert(offsetof(PlayerBasicInfo, nameplate_id) == 0x3E6);

		namespace impl
		{
			struct FobMission2CallbackImpl
			{
				char __pad0[176];
				char state;
				char __pad1[0x1000];
			};

			struct StaffControllerImpl
			{
				enum Rank
				{
					RANK_E = 0,
					RANK_D = 1,
					RANK_C = 2,
					RANK_B = 3,
					RANK_A = 4,
					RANK_AP = 5,
					RANK_APP = 6,
					RANK_S = 7,
					RANK_SP = 8,
					RANK_SPP = 9,
				};

				enum Designation
				{
					DESIGNATION_NONE = 0,
					DESIGNATION_UNITS_START = 1,
					DESIGNATION_COMBAT = 1,
					DESIGNATION_RND = 2,
					DESIGNATION_BASE_DEV = 3,
					DESIGNATION_SUPPORT = 4,
					DESIGNATION_INTEL = 5,
					DESIGNATION_MEDICAL = 6,
					DESIGNATION_SECURITY = 7,
					DESIGNATION_SICKBAY = 8,
					DESIGNATION_UNITS_END = 8,
					DESIGNATION_BRIG = 9,
					DESIGNATION_QUARANTINE = 10,
					DESIGNATION_WAITING_ROOM_1 = 11,
					DESIGNATION_WAITING_ROOM_2 = 12,
					DESIGNATION_WAITING_ROOM_3 = 13,
					DESIGNATION_WAITING_ROOM_4 = 14,
					DESIGNATION_WAITING_ROOM_5 = 15,
					DESIGNATION_COUNT,
				};

				enum Skill
				{
					SKILL_GUNMAN = 1,
					SKILL_CLIMBER = 2,
					SKILL_ATHLETE = 3,
					SKILL_RESCUER = 5,
					SKILL_QUICK_RELOAD = 6,
					SKILL_TOUGH_GUY = 7,
					SKILL_FORTUNATE = 8,
					SKILL_SAVAGE = 9,
					SKILL_BOASTER = 10,
					SKILL_BOTANIST = 11,
					SKILL_QUICK_DRAW = 12,
					SKILL_VANGUARD_SHARPSHOOTER = 13,
					SKILL_PROSTHETIC_MOBILITY_1 = 14,
					SKILL_PROSTHETIC_MOBILITY_2 = 15,
					SKILL_PROSTHETIC_MOBILITY_3 = 16,
					SKILL_PROSTHETIC_PRECISION_MOVEMENT_1 = 17,
					SKILL_PROSTHETIC_PRECISION_MOVEMENT_2 = 18,
					SKILL_PROSTHETIC_PRECISION_MOVEMENT_3 = 19,
					SKILL_PROSTHETIC_FIRST_AID_FUNCTION_1 = 20,
					SKILL_PROSTHETIC_FIRST_AID_FUNCTION_2 = 21,
					SKILL_PROSTHETIC_FIRST_AID_FUNCTION_3 = 22,
					SKILL_GUNSMITH_HANDGUNS = 23,
					SKILL_GUNSMITH_SUBMACHINE_GUNS = 24,
					SKILL_GUNSMITH_ASSAULT_RIFLES = 25,
					SKILL_GUNSMITH_SHOTGUNS = 26,
					SKILL_GUNSMITH_GRENADE_LAUNCHERS = 27,
					SKILL_GUNSMITH_SNIPER_RIFLES = 28,
					SKILL_GUNSMITH_MACHINE_GUNS = 29,
					SKILL_GUNSMITH_MISSILE_LAUNCHERS = 30,
					SKILL_MASTER_GUNSMITH = 31,
					SKILL_ANESTHESIA_SPECIALIST = 32,
					SKILL_NOISE_SUPPRESSION_SPECIALIST = 33,
					SKILL_MISSILE_GUIDANCE_SPECIALIST = 34,
					SKILL_ZOOLOGIST = 35,
					SKILL_SLEEPING_GAS_SPECIALIST = 36,
					SKILL_TRAP_SPECIALIST = 37,
					SKILL_ELECTROMAGNETC_NET_SPECIALIST = 38,
					SKILL_RADAR_SPECIALIST = 40,
					SKILL_METAMATERIALS_SPECIALIST = 41,
					SKILL_DRUG_DEVELOPER = 42,
					SKILL_BIONICS_SPECIALIST = 43,
					SKILL_MECHATRONICS_SPECIALIST = 44,
					SKILL_CYBERNETICS_SPECIALIST = 45,
					SKILL_ROCKET_CONTROL_SPECIALIST = 46,
					SKILL_ELECTROSPINNING_SPECIALIST = 47,
					SKILL_MATERIALS_ENGINEER = 48,
					SKILL_TRANSPORTATION_SPECIALIST = 49,
					SKILL_VIDEO_SURVEILLANCE_SPECIALIST = 51,
					SKILL_BIPEDAL_WEAPONS_DEVELOPER = 54,
					SKILL_INTERPRETER_RUSSIAN = 55,
					SKILL_INTERPRETER_AFRIKAANS = 56,
					SKILL_INTERPRETER_KIKONGO = 57,
					SKILL_INTERPRETER_PASHTO = 58,
					SKILL_SURGEON = 59,
					SKILL_PHYSICIAN = 60,
					SKILL_COUNSELOR = 61,
					SKILL_PARASITOLOGIST = 62,
					SKILL_TROUBLEMAKER_VIOLENCE = 63,
					SKILL_TROUBLEMAKER_UNSANITARY = 64,
					SKILL_TROUBLEMAKER_HARASSMENT = 65,
					SKILL_DIPLOMAT = 66,
					SKILL_TACTICAL_INSTRUCTOR = 67,
					SKILL_MOTHER_BASE_XO = 68,
					SKILL_REQUIRED_END = 69,
					SKILL_DEFENDER_1 = 69,
					SKILL_DEFENDER_2 = 70,
					SKILL_DEFENDER_3 = 71,
					SKILL_SENTRY_1 = 72,
					SKILL_SENTRY_2 = 73,
					SKILL_SENTRY_3 = 74,
					SKILL_RANGER_1 = 75,
					SKILL_RANGER_2 = 76,
					SKILL_RANGER_3 = 77,
					SKILL_MEDIC_1 = 78,
					SKILL_MEDIC_2 = 79,
					SKILL_MEDIC_3 = 80,
					SKILL_LIQUID_CARBON_MISSILE_ENGINEER_1 = 81,
					SKILL_LIQUID_CARBON_MISSILE_ENGINEER_2 = 82,
					SKILL_LIQUID_CARBON_MISSILE_ENGINEER_3 = 83,
					SKILL_ANTI_BALLISTIC_MISSILE_ENGINEER_1 = 84,
					SKILL_ANTI_BALLISTIC_MISSILE_ENGINEER_2 = 85,
					SKILL_ANTI_BALLISTIC_MISSILE_ENGINEER_3 = 86,
				};

				enum StatDistribution
				{
					STAT_DIST_NONE_1 = 0b11010,
					STAT_DIST_NONE_2 = 0b11011,
					STAT_DIST_NONE_3 = 0b11100,
					STAT_DIST_NONE_4 = 0b11101,
					STAT_DIST_NONE_5 = 0b100100,
					STAT_DIST_NONE_6 = 0b100101,
					STAT_DIST_NONE_7 = 0b100110,
					STAT_DIST_NONE_8 = 0b100111,
					STAT_DIST_NONE_9 = 0b111011,
					STAT_DIST_SECURITY = 0b1,
					STAT_DIST_BASE_DEV_FOCUS = 0b100,
					STAT_DIST_BASE_DEV_AND_COMBAT = 0b110011,
					STAT_DIST_BASE_DEV_AND_INTEL = 0b10010,
					STAT_DIST_BASE_DEV_PLUS_AND_INTEL_PLUS = 0b110001,
					STAT_DIST_BASE_DEV_AND_MEDICAL = 0b10011,
					STAT_DIST_BASE_DEV_PLUS_AND_MEDICAL_PLUS = 0b110010,
					STAT_DIST_BASE_DEV_AND_RND = 0b101110,
					STAT_DIST_BASE_DEV_AND_SUPPORT_AND_INTEL_AND_MEDICAL = 0b100000,
					STAT_DIST_BASE_DEV_AND_SUPPORT = 0b10001,
					STAT_DIST_BASE_DEV_PLUS_AND_SUPPORT_PLUS = 0b110000,
					STAT_DIST_COMBAT_FOCUS = 0b10,
					STAT_DIST_COMBAT_AND_BASE_DEV = 0b101111,
					STAT_DIST_COMBAT_AND_INTEL = 0b1001,
					STAT_DIST_COMBAT_PLUS_AND_INTEL_PLUS = 0b101001,
					STAT_DIST_COMBAT_AND_MEDICAL = 0b1010,
					STAT_DIST_COMBAT_AND_RND = 0b1000,
					STAT_DIST_COMBAT_AND_SUPPORT_AND_INTEL_AND_MEDICAL = 0b11111,
					STAT_DIST_COMBAT_AND_SUPPORT = 0b101000,
					STAT_DIST_INTEL_FOCUS = 0b110,
					STAT_DIST_INTEL_AND_BASE_DEV = 0b10000,
					STAT_DIST_INTEL_PLUS_AND_BASE_DEV_PLUS = 0b110110,
					STAT_DIST_INTEL_AND_COMBAT_AND_SUPPORT_AND_MEDICAL = 0b100010,
					STAT_DIST_INTEL_AND_COMBAT = 0b1110,
					STAT_DIST_INTEL_PLUS_AND_COMBAT_PLUS = 0b111001,
					STAT_DIST_INTEL_AND_MEDICAL = 0b111000,
					STAT_DIST_INTEL_AND_RND = 0b1111,
					STAT_DIST_INTEL_AND_SUPPORT = 0b111010,
					STAT_DIST_MEDICAL_FOCUS = 0b111,
					STAT_DIST_MEDICAL_AND_BASE_DEV_AND_SUPPORT_AND_INTEL = 0b100011,
					STAT_DIST_MEDICAL_AND_BASE_DEV = 0b11000,
					STAT_DIST_MEDICAL_PLUS_AND_BASE_DEV_PLUS = 0b111110,
					STAT_DIST_MEDICAL_AND_COMBAT = 0b10111,
					STAT_DIST_MEDICAL_PLUS_AND_COMBAT_PLUS = 0b111100,
					STAT_DIST_MEDICAL_AND_INTEL = 0b110111,
					STAT_DIST_MEDICAL_AND_RND = 0b111101,
					STAT_DIST_MEDICAL_AND_SUPPORT = 0b11001,
					STAT_DIST_RND_FOCUS = 0b11,
					STAT_DIST_RND_AND_BASE_DEV = 0b1011,
					STAT_DIST_RND_PLUS_AND_BASE_DEV_PLUS = 0b101011,
					STAT_DIST_RND_AND_COMBAT = 0b101010,
					STAT_DIST_RND_AND_MEDICAL = 0b1101,
					STAT_DIST_RND_PLUS_AND_MEDICAL_PLUS = 0b101101,
					STAT_DIST_RND_AND_SUPPORT_AND_INTEL_AND_MEDICAL = 0b11110,
					STAT_DIST_RND_AND_SUPPORT = 0b1100,
					STAT_DIST_RND_PLUS_AND_SUPPORT_PLUS = 0b101100,
					STAT_DIST_SUPPORT_FOCUS = 0b101,
					STAT_DIST_SUPPORT_AND_COMBAT = 0b10100,
					STAT_DIST_SUPPORT_PLUS_AND_COMBAT_PLUS = 0b110100,
					STAT_DIST_SUPPORT_AND_INTEL = 0b10110,
					STAT_DIST_SUPPORT_PLUS_AND_INTEL_PLUS = 0b110101,
					STAT_DIST_SUPPORT_AND_RND_AND_INTEL_AND_MEDICAL = 0b100001,
					STAT_DIST_SPECIAL_CHARACTER = 0b111111,
				};

				union StaffHeader
				{
					struct
					{
						std::uint32_t suppress_stats : 1;
						std::uint32_t stat_bonus : 2;
						std::uint32_t peak_rank : 4;
						std::uint32_t stat_distribution : 6;
						std::uint32_t skill : 7;
						std::uint32_t face_gender : 10;
						std::uint32_t unk : 2;
					} fields;
					std::uint32_t data;
				};

				union StaffStatusSync
				{
					struct
					{
						std::uint32_t combat_deployment_team : 4;
						std::uint32_t player_selected : 3;
						std::uint32_t direct_contract : 1;
						std::uint32_t proficiency : 4;
						std::uint32_t ds_medal : 1;
						std::uint32_t ds_cross : 1;
						std::uint32_t honor_medal : 1;
						std::uint32_t unk : 1;
						std::uint32_t symptomatic : 1;
						std::uint32_t health_level : 3;
						std::uint32_t health_state : 2;
						std::uint32_t morale : 4;
						std::uint32_t enemy : 1;
						std::uint32_t designation : 4;
						std::uint32_t unselectable : 1;
					} fields;
					std::uint32_t data;
				};

				struct StaffSeed
				{
					std::uint32_t data;
				};

				union StaffStatusNoSync
				{
					struct
					{
						std::uint16_t locked : 1;
						std::uint16_t unk : 15;
					} fields;
					std::uint16_t data;
				};

				struct StaffUnk1
				{
					std::uint32_t data;
				};

				struct StaffUnk2
				{
					std::uint32_t data;
				};

				union Staff
				{
					struct
					{
						StaffUnk1 unk1;
						StaffUnk2 unk2;
						StaffHeader header;
						StaffSeed seed;
						StaffStatusSync status_sync;
						StaffStatusNoSync status_no_sync;
					} fields;
					std::uint32_t packed[6];
				};

				struct vtable
				{
					void(__fastcall* meth_000)(StaffControllerImpl*);
					void(__fastcall* meth_001)(StaffControllerImpl*);
					void(__fastcall* meth_002)(StaffControllerImpl*);
					void(__fastcall* meth_003)(StaffControllerImpl*);
					void(__fastcall* meth_004)(StaffControllerImpl*);
					void(__fastcall* meth_005)(StaffControllerImpl*);
					void(__fastcall* meth_006)(StaffControllerImpl*);
					void(__fastcall* meth_007)(StaffControllerImpl*);
					void(__fastcall* meth_008)(StaffControllerImpl*);
					void(__fastcall* meth_009)(StaffControllerImpl*);
					void(__fastcall* meth_010)(StaffControllerImpl*);
					void(__fastcall* meth_011)(StaffControllerImpl*);
					void(__fastcall* meth_012)(StaffControllerImpl*);
					void(__fastcall* meth_013)(StaffControllerImpl*);
					void(__fastcall* meth_014)(StaffControllerImpl*);
					void(__fastcall* meth_015)(StaffControllerImpl*);
					void(__fastcall* meth_016)(StaffControllerImpl*);
					void(__fastcall* meth_017)(StaffControllerImpl*);
					void(__fastcall* meth_018)(StaffControllerImpl*);
					void(__fastcall* meth_019)(StaffControllerImpl*);
					void(__fastcall* meth_020)(StaffControllerImpl*);
					void(__fastcall* meth_021)(StaffControllerImpl*);
					void(__fastcall* meth_022)(StaffControllerImpl*);
					void(__fastcall* meth_023)(StaffControllerImpl*);
					void(__fastcall* meth_024)(StaffControllerImpl*);
					void(__fastcall* meth_025)(StaffControllerImpl*);
					void(__fastcall* meth_026)(StaffControllerImpl*);
					void(__fastcall* meth_027)(StaffControllerImpl*);
					void(__fastcall* meth_028)(StaffControllerImpl*);
					void(__fastcall* meth_029)(StaffControllerImpl*);
					void(__fastcall* meth_030)(StaffControllerImpl*);
					void(__fastcall* meth_031)(StaffControllerImpl*);
					void(__fastcall* meth_032)(StaffControllerImpl*);
					void(__fastcall* meth_033)(StaffControllerImpl*);
					void(__fastcall* meth_034)(StaffControllerImpl*);
					void(__fastcall* meth_035)(StaffControllerImpl*);
					void(__fastcall* meth_036)(StaffControllerImpl*);
					void(__fastcall* meth_037)(StaffControllerImpl*);
					void(__fastcall* meth_038)(StaffControllerImpl*);
					void(__fastcall* meth_039)(StaffControllerImpl*);
					void(__fastcall* meth_040)(StaffControllerImpl*);
					void(__fastcall* meth_041)(StaffControllerImpl*);
					void(__fastcall* meth_042)(StaffControllerImpl*);
					void(__fastcall* meth_043)(StaffControllerImpl*);
					void(__fastcall* meth_044)(StaffControllerImpl*);
					void(__fastcall* meth_045)(StaffControllerImpl*);
					void(__fastcall* meth_046)(StaffControllerImpl*);
					void(__fastcall* meth_047)(StaffControllerImpl*);
					void(__fastcall* meth_048)(StaffControllerImpl*);
					void(__fastcall* meth_049)(StaffControllerImpl*);
					void(__fastcall* meth_050)(StaffControllerImpl*);
					void(__fastcall* meth_051)(StaffControllerImpl*);
					void(__fastcall* meth_052)(StaffControllerImpl*);
					void(__fastcall* meth_053)(StaffControllerImpl*);
					void(__fastcall* meth_054)(StaffControllerImpl*);
					void(__fastcall* meth_055)(StaffControllerImpl*);
					void(__fastcall* meth_056)(StaffControllerImpl*);
					void(__fastcall* meth_057)(StaffControllerImpl*);
					void(__fastcall* meth_058)(StaffControllerImpl*);
					void(__fastcall* meth_059)(StaffControllerImpl*);
					void(__fastcall* meth_060)(StaffControllerImpl*);
					void(__fastcall* meth_061)(StaffControllerImpl*);
					void(__fastcall* meth_062)(StaffControllerImpl*);
					void(__fastcall* meth_063)(StaffControllerImpl*);
					void(__fastcall* meth_064)(StaffControllerImpl*);
					void(__fastcall* meth_065)(StaffControllerImpl*);
					void(__fastcall* meth_066)(StaffControllerImpl*);
					void(__fastcall* meth_067)(StaffControllerImpl*);
					void(__fastcall* meth_068)(StaffControllerImpl*);
					void(__fastcall* meth_069)(StaffControllerImpl*);
					void(__fastcall* meth_070)(StaffControllerImpl*);
					void(__fastcall* meth_071)(StaffControllerImpl*);
					void(__fastcall* meth_072)(StaffControllerImpl*);
					void(__fastcall* meth_073)(StaffControllerImpl*);
					void(__fastcall* meth_074)(StaffControllerImpl*);
					void(__fastcall* meth_075)(StaffControllerImpl*);
					void(__fastcall* meth_076)(StaffControllerImpl*);
					void(__fastcall* meth_077)(StaffControllerImpl*);
					void(__fastcall* meth_078)(StaffControllerImpl*);
					void(__fastcall* meth_079)(StaffControllerImpl*);
					void(__fastcall* meth_080)(StaffControllerImpl*);
					void(__fastcall* meth_081)(StaffControllerImpl*);
					void(__fastcall* meth_082)(StaffControllerImpl*);
					void(__fastcall* meth_083)(StaffControllerImpl*);
					void(__fastcall* meth_084)(StaffControllerImpl*);
					void(__fastcall* meth_085)(StaffControllerImpl*);
					void(__fastcall* meth_086)(StaffControllerImpl*);
					void(__fastcall* meth_087)(StaffControllerImpl*);
					void(__fastcall* meth_088)(StaffControllerImpl*);
					void(__fastcall* meth_089)(StaffControllerImpl*);
					void(__fastcall* meth_090)(StaffControllerImpl*);
					void(__fastcall* meth_091)(StaffControllerImpl*);
					void(__fastcall* meth_092)(StaffControllerImpl*);
					void(__fastcall* meth_093)(StaffControllerImpl*);
					void(__fastcall* meth_094)(StaffControllerImpl*);
					void(__fastcall* meth_095)(StaffControllerImpl*);
					void(__fastcall* meth_096)(StaffControllerImpl*);
					void(__fastcall* meth_097)(StaffControllerImpl*);
					void(__fastcall* meth_098)(StaffControllerImpl*);
					void(__fastcall* meth_099)(StaffControllerImpl*);
					void(__fastcall* meth_100)(StaffControllerImpl*);
					void(__fastcall* meth_101)(StaffControllerImpl*);
					void(__fastcall* meth_102)(StaffControllerImpl*);
					void(__fastcall* meth_103)(StaffControllerImpl*);
					void(__fastcall* meth_104)(StaffControllerImpl*);
					void(__fastcall* meth_105)(StaffControllerImpl*);
					void(__fastcall* meth_106)(StaffControllerImpl*);
					void(__fastcall* meth_107)(StaffControllerImpl*);
					void(__fastcall* meth_108)(StaffControllerImpl*);
					void(__fastcall* meth_109)(StaffControllerImpl*);
					void(__fastcall* meth_110)(StaffControllerImpl*);
					void(__fastcall* meth_111)(StaffControllerImpl*);
					void(__fastcall* meth_112)(StaffControllerImpl*);
					void(__fastcall* meth_113)(StaffControllerImpl*);
					void(__fastcall* meth_114)(StaffControllerImpl*);
					void(__fastcall* meth_115)(StaffControllerImpl*);
					void(__fastcall* meth_116)(StaffControllerImpl*);
					void(__fastcall* meth_117)(StaffControllerImpl*);
					void(__fastcall* meth_118)(StaffControllerImpl*);
					void(__fastcall* meth_119)(StaffControllerImpl*);
					void(__fastcall* meth_120)(StaffControllerImpl*);
					void(__fastcall* meth_121)(StaffControllerImpl*);
					void(__fastcall* meth_122)(StaffControllerImpl*);
					void(__fastcall* meth_123)(StaffControllerImpl*);
					void(__fastcall* meth_124)(StaffControllerImpl*);
					void(__fastcall* meth_125)(StaffControllerImpl*);
					void(__fastcall* meth_126)(StaffControllerImpl*);
					void(__fastcall* meth_127)(StaffControllerImpl*);
					void(__fastcall* meth_128)(StaffControllerImpl*);
					void(__fastcall* meth_129)(StaffControllerImpl*);
					void(__fastcall* meth_130)(StaffControllerImpl*);
					void(__fastcall* meth_131)(StaffControllerImpl*);
					void(__fastcall* meth_132)(StaffControllerImpl*);
					void(__fastcall* meth_133)(StaffControllerImpl*);
					void(__fastcall* meth_134)(StaffControllerImpl*);
					void(__fastcall* meth_135)(StaffControllerImpl*);
					void(__fastcall* meth_136)(StaffControllerImpl*);
					void(__fastcall* meth_137)(StaffControllerImpl*);
					void(__fastcall* meth_138)(StaffControllerImpl*);
					void(__fastcall* meth_139)(StaffControllerImpl*);
					void(__fastcall* meth_140)(StaffControllerImpl*);
					bool(__fastcall* CanFobStaff)(StaffControllerImpl*, StaffHeader, StaffSeed, StaffStatusSync, StaffStatusNoSync);
					void(__fastcall* meth_142)(StaffControllerImpl*);
					void(__fastcall* meth_143)(StaffControllerImpl*);
					void(__fastcall* meth_144)(StaffControllerImpl*);
					void(__fastcall* meth_145)(StaffControllerImpl*);
					void(__fastcall* meth_146)(StaffControllerImpl*);
					void(__fastcall* meth_147)(StaffControllerImpl*);
					void(__fastcall* meth_148)(StaffControllerImpl*);
					void(__fastcall* meth_149)(StaffControllerImpl*);
					void(__fastcall* meth_150)(StaffControllerImpl*);
					void(__fastcall* meth_151)(StaffControllerImpl*);
					void(__fastcall* meth_152)(StaffControllerImpl*);
					void(__fastcall* meth_153)(StaffControllerImpl*);
					void(__fastcall* meth_154)(StaffControllerImpl*);
					void(__fastcall* meth_155)(StaffControllerImpl*);
					void(__fastcall* meth_156)(StaffControllerImpl*);
					void(__fastcall* meth_157)(StaffControllerImpl*);
					void(__fastcall* meth_158)(StaffControllerImpl*);
					void(__fastcall* meth_159)(StaffControllerImpl*);
					void(__fastcall* meth_160)(StaffControllerImpl*);
					void(__fastcall* meth_161)(StaffControllerImpl*);
					void(__fastcall* meth_162)(StaffControllerImpl*);
					void(__fastcall* meth_163)(StaffControllerImpl*);
					void(__fastcall* meth_164)(StaffControllerImpl*);
					void(__fastcall* meth_165)(StaffControllerImpl*);
					void(__fastcall* meth_166)(StaffControllerImpl*);
					void(__fastcall* meth_167)(StaffControllerImpl*);
					void(__fastcall* meth_168)(StaffControllerImpl*);
					void(__fastcall* meth_169)(StaffControllerImpl*);
					void(__fastcall* meth_170)(StaffControllerImpl*);
					void(__fastcall* meth_171)(StaffControllerImpl*);
					void(__fastcall* meth_172)(StaffControllerImpl*);
					void(__fastcall* meth_173)(StaffControllerImpl*);
					void(__fastcall* meth_174)(StaffControllerImpl*);
					void(__fastcall* meth_175)(StaffControllerImpl*);
					void(__fastcall* meth_176)(StaffControllerImpl*);
					void(__fastcall* meth_177)(StaffControllerImpl*);
					void(__fastcall* meth_178)(StaffControllerImpl*);
					void(__fastcall* meth_179)(StaffControllerImpl*);
					void(__fastcall* meth_180)(StaffControllerImpl*);
					void(__fastcall* meth_181)(StaffControllerImpl*);
					void(__fastcall* meth_182)(StaffControllerImpl*);
					void(__fastcall* meth_183)(StaffControllerImpl*);
					void(__fastcall* meth_184)(StaffControllerImpl*);
					void(__fastcall* meth_185)(StaffControllerImpl*);
					void(__fastcall* meth_186)(StaffControllerImpl*);
					void(__fastcall* meth_187)(StaffControllerImpl*);
					void(__fastcall* meth_188)(StaffControllerImpl*);
					void(__fastcall* meth_189)(StaffControllerImpl*);
					void(__fastcall* meth_190)(StaffControllerImpl*);
					void(__fastcall* meth_191)(StaffControllerImpl*);
					void(__fastcall* meth_192)(StaffControllerImpl*);
					void(__fastcall* meth_193)(StaffControllerImpl*);
					void(__fastcall* meth_194)(StaffControllerImpl*);
					void(__fastcall* meth_195)(StaffControllerImpl*);
					void(__fastcall* meth_196)(StaffControllerImpl*);
					void(__fastcall* meth_197)(StaffControllerImpl*);
					void(__fastcall* meth_198)(StaffControllerImpl*);
					void(__fastcall* meth_199)(StaffControllerImpl*);
					void(__fastcall* meth_200)(StaffControllerImpl*);
					void(__fastcall* meth_201)(StaffControllerImpl*);
					void(__fastcall* meth_202)(StaffControllerImpl*);
					void(__fastcall* meth_203)(StaffControllerImpl*);
					void(__fastcall* meth_204)(StaffControllerImpl*);
					void(__fastcall* meth_205)(StaffControllerImpl*);
					void(__fastcall* meth_206)(StaffControllerImpl*);
					void(__fastcall* meth_207)(StaffControllerImpl*);
					void(__fastcall* meth_208)(StaffControllerImpl*);
					void(__fastcall* meth_209)(StaffControllerImpl*);
					void(__fastcall* meth_210)(StaffControllerImpl*);
					void(__fastcall* meth_211)(StaffControllerImpl*);
					void(__fastcall* meth_212)(StaffControllerImpl*);
					void(__fastcall* meth_213)(StaffControllerImpl*);
					void(__fastcall* meth_214)(StaffControllerImpl*);
					void(__fastcall* meth_215)(StaffControllerImpl*);
					void(__fastcall* meth_216)(StaffControllerImpl*);
					void(__fastcall* meth_217)(StaffControllerImpl*);
					void(__fastcall* meth_218)(StaffControllerImpl*);
					void(__fastcall* meth_219)(StaffControllerImpl*);
					void(__fastcall* meth_220)(StaffControllerImpl*);
					void(__fastcall* meth_221)(StaffControllerImpl*);
					void(__fastcall* meth_222)(StaffControllerImpl*);
					void(__fastcall* meth_223)(StaffControllerImpl*);
					void(__fastcall* meth_224)(StaffControllerImpl*);
					void(__fastcall* meth_225)(StaffControllerImpl*);
					void(__fastcall* meth_226)(StaffControllerImpl*);
					void(__fastcall* meth_227)(StaffControllerImpl*);
					void(__fastcall* meth_228)(StaffControllerImpl*);
					void(__fastcall* meth_229)(StaffControllerImpl*);
					void(__fastcall* meth_230)(StaffControllerImpl*);
					void(__fastcall* meth_231)(StaffControllerImpl*);
					void(__fastcall* meth_232)(StaffControllerImpl*);
					void(__fastcall* meth_233)(StaffControllerImpl*);
					void(__fastcall* meth_234)(StaffControllerImpl*);
					void(__fastcall* meth_235)(StaffControllerImpl*);
					void(__fastcall* meth_236)(StaffControllerImpl*);
					void(__fastcall* meth_237)(StaffControllerImpl*);
					void(__fastcall* meth_238)(StaffControllerImpl*);
					void(__fastcall* meth_239)(StaffControllerImpl*);
					void(__fastcall* meth_240)(StaffControllerImpl*);
					void(__fastcall* meth_241)(StaffControllerImpl*);
					void(__fastcall* meth_242)(StaffControllerImpl*);
					void(__fastcall* meth_243)(StaffControllerImpl*);
					void(__fastcall* meth_244)(StaffControllerImpl*);
					void(__fastcall* meth_245)(StaffControllerImpl*);
					void(__fastcall* meth_246)(StaffControllerImpl*);
					void(__fastcall* meth_247)(StaffControllerImpl*);
					void(__fastcall* meth_248)(StaffControllerImpl*);
					void(__fastcall* meth_249)(StaffControllerImpl*);
					void(__fastcall* meth_250)(StaffControllerImpl*);
					void(__fastcall* meth_251)(StaffControllerImpl*);
					void(__fastcall* meth_252)(StaffControllerImpl*);
					void(__fastcall* meth_253)(StaffControllerImpl*);
					void(__fastcall* meth_254)(StaffControllerImpl*);
					void(__fastcall* meth_255)(StaffControllerImpl*);
				};

				vtable* __vftable;
				char __pad0[40048];
				StaffHeader* mbmStaffSvarsHeaders;
				StaffSeed* mbmStaffSvarsSeeds;
				StaffStatusSync* mbmStaffSvarsStatusesSync;
				StaffStatusNoSync* mbmStaffSvarsStatusesNoSync;
				char __pad1[392];
				StaffHeader* mbmRemoverSvarsHeaders;
				StaffSeed* mbmRemoverSvarsSeeds;
				StaffStatusSync* mbmRemoverSvarsStatusesSync;
				StaffStatusNoSync* mbmRemoverSvarsStatusesNoSync;
				char __pad2[44];
				short staffCount;
				char __pad3[4];
				__int16 sectionCounts[7];
				char __pad4[474];
				unsigned __int8 sectionLevels[7];
			};

			static_assert(offsetof(StaffControllerImpl, mbmStaffSvarsHeaders) == 0x9C78);
			static_assert(offsetof(StaffControllerImpl, mbmStaffSvarsStatusesSync) == 0x9C88);

			struct ResourceControllerImpl
			{
				struct UsableResource
				{
					std::uint32_t sign : 1;
					std::uint32_t count : 20;
					std::uint32_t unk : 11;
				};

				struct ProcessingResource
				{
					std::uint32_t unk1 : 3;
					std::uint32_t count : 20;
					std::uint32_t unk2 : 11;
				};

				struct vtable
				{
					void(__fastcall* meth_01)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_02)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_03)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_04)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* AddResource)(tpp::mbm::impl::ResourceControllerImpl*, unsigned char, int, char, bool, bool, bool);
					void(__fastcall* meth_06)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_07)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_08)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_09)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_10)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_11)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_12)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_13)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_14)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_15)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_16)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_17)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_18)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_19)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_20)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_21)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_22)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_23)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_24)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_25)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_26)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_27)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_28)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_29)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_30)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_31)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_32)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_33)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_34)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_35)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_36)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_37)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_38)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_39)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_40)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_41)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_42)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_43)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_44)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_45)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_46)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_47)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_48)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_49)(tpp::mbm::impl::ResourceControllerImpl*);
					void(__fastcall* meth_50)(tpp::mbm::impl::ResourceControllerImpl*);
				};

				vtable* __vftable;
				char __pad0[4584];
				UsableResource* usableResource;
				ProcessingResource* processingResource;
			};

			struct MotherBaseManagementSystemImpl
			{
				struct vtable
				{
					void(__fastcall* meth_01)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_02)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_03)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_04)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_05)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_06)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* AddTppGmp)(tpp::mbm::impl::MotherBaseManagementSystemImpl*, unsigned int);
					void(__fastcall* SubTppGmp)(tpp::mbm::impl::MotherBaseManagementSystemImpl*, unsigned int);
					void(__fastcall* meth_09)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_10)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_11)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_12)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_13)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_14)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_15)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_16)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_17)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_18)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_19)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_20)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_21)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_22)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_23)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_24)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_25)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_26)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_27)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_28)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_29)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_30)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_31)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_32)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_33)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_34)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_35)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_36)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_37)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_38)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_39)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_40)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_41)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_42)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_43)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_44)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_45)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* ReflectHeroicPointDiffToSvars)(tpp::mbm::impl::MotherBaseManagementSystemImpl*, int);
					void(__fastcall* meth_47)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_48)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_49)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
					void(__fastcall* meth_50)(tpp::mbm::impl::MotherBaseManagementSystemImpl*);
				};

				vtable* __vftable;
				char __pad0[2584];
				int* heroicPoint;
				int* heroicPointDiff;
				int* ogrePoint;
				int* ogrePointDiff;
				char __pad2[128];
				StaffControllerImpl* staffController;
				char __pad3[24];
				ResourceControllerImpl* resourceController;
			};

			static_assert(offsetof(MotherBaseManagementSystemImpl, staffController) == 2752);
			static_assert(offsetof(MotherBaseManagementSystemImpl, heroicPointDiff) == 2600);
			static_assert(offsetof(MotherBaseManagementSystemImpl, ogrePoint) == 0xA30);
		}
	}

	namespace tpp::net
	{
		struct ServerManager_vtbl
		{

		};

		struct ServerManager
		{
			ServerManager_vtbl* __vftable;
		};

		struct SessionConnectInfo
		{
			int a1;
			char __pad0[180];
			std::uint64_t hostParam;
		};

		struct RequestDisplayImpl
		{
			struct vtable
			{

			};

			vtable* __vftable;
			fox::gk::FirstPartyAccount* unkArray[12];
			char __pad1[704];
			int a1;
			int a2;
		};

		struct DisplayName
		{
			struct vtable
			{

			};

			vtable* __vftable;
			RequestDisplayImpl* requestDisplay;
		};

		struct ServerReceiveBase
		{
			struct vtable
			{
				void(__fastcall* __destructor)(tpp::net::ServerReceiveBase*);
				void(__fastcall* Release)(tpp::net::ServerReceiveBase*);
				void(__fastcall* Receive)(tpp::net::ServerReceiveBase*, void** ptr);
				void(__fastcall* Success)(tpp::net::ServerReceiveBase*, void** ptr);
				void(__fastcall* Failure)(tpp::net::ServerReceiveBase*, void** ptr);
			};

			vtable* __vftable;
			fox::pfimpl pf;
		};

		struct ServerRequestBase
		{
			struct vtable
			{

			};

			tpp::net::ServerRequestBase::vtable* __vftable;
			fox::ncl::NclHttpCodec* httpCodec;
			int state;
			int mode;
			fox::StringId unkString;
			int a5;
			char a6;
		};

		struct FobTarget : ServerRequestBase
		{
			mbm::PlayerBasicInfo* playerInfos;
			char __pad2[8];
			short maxPlayers;
			char __pad3[10];
			SessionConnectInfo* sessionConnectInfo;
			DisplayName* displayName1;
			DisplayName* displayName2;
		};

		struct PlayerPlatformInfo
		{
			struct Npid
			{
				struct
				{
					fox::String data;
					int term;
					struct
					{
						int value[3];
						int count;
					} dummy;
				} handler;
				struct
				{
					int value[8];
					int count;
				} opt;
				struct
				{
					int value[8];
					int count;
				} reserved;
			};

			int playerId;
			int playerPlatformInfoField0;
			fox::String name;
			Npid npid;
			unsigned __int64 xuid;
			int ugc;
			int playerPlatformInfo31;
		};

		struct ClusterSecurity
		{
			struct CoordParam
			{
				int placed_index;
				int position_x;
				int position_y;
				int position_z;
				int rotation_w;
				int rotation_x;
				int rotation_y;
				int rotation_z;
			};

			int soldier;
			int ir_sensor;
			int antitheft;
			int camera;
			int decoy;
			int mine;
			int uav;
			int caution_area;
			int voluntary_coord_camera_count;
			int voluntary_coord_mine_count;
			CoordParam voluntary_coord_camera_params[1];
			int camera_count;
			CoordParam voluntary_coord_mine_params[4];
			int mine_count;
		};

		struct ClusterParam
		{
			int build;
			int soldier_rank;
			int cluster_security;
			ClusterSecurity unique_security;
			ClusterSecurity common1_security;
			ClusterSecurity common2_security;
			ClusterSecurity common3_security;
		};

		struct MotherBaseParam
		{
			int mother_base_id;
			int fob_index;
			int construct_param;
			int security_rank;
			int platform_count;
			int price;
			ClusterParam cluster_param[7];
			int cluster_param_count;
			int area_id;
		};

		struct FobTargetInfo
		{
			struct Emblem
			{
				struct EmblemPart
				{
					int texture_tag;
					int base_color;
					int frame_color;
					int position_x;
					int position_y;
					int scale;
					int rotate;
				};

				EmblemPart parts[4];
				int part_count;
			};

			struct Espionage
			{
				int section;
				int win;
				int lose;
				int score;
			};

			struct Rank
			{
				int grade;
				int rank;
				int score;
			};

			struct DetailRecord
			{
				int follow;
				int follower;
				int hero;
				int enemy;
				int help;
				int online;
				int insurance;
				Emblem emblem;
				int staff_count;
				int nuclear;
				Rank league_rank;
				Rank sneak_rank;
				Espionage espionage;
				int name_plate_id;
				int is_security_challenge;
			};

			struct Resource
			{
				int common_metal;
				int minor_metal;
				int precious_metal;
				int fuel_resource;
				int biotic_resource;
			};

			struct StaffCount
			{
				int count[10];
				int num_count;
			};

			struct FobRecord
			{
				int attack_count;
				int support_count;
				int supported_count;
				Resource usable_resource;
				Resource processing_resource;
				StaffCount staff_count;
				StaffCount capture_staff_count;
				StaffCount injury_staff_count;
				int nuclear;
				int capture_staff;
				Resource capture_resource;
				int capture_resource_count;
				int attack_gmp;
				int capture_nuclear;
				int left_hour;
				int date_time;
				int name_plate_id;
			};

			PlayerPlatformInfo owner_info;
			DetailRecord owner_detail_record;
			FobRecord owner_fob_record;
			int sneak_mode;
			int is_win;
			int cluster;
			int is_sneak_restriction;
			MotherBaseParam mother_base_param[4];
			int num_param;
			PlayerPlatformInfo attacker_info;
			Emblem attacker_emblem;
			Espionage attacker_espionage;
			int attacker_sneak_rank_grade;
		};

		struct FobDeployDamageParam
		{
			int expiration_date;
			int damage_values[16];
			int damage_value_count;
			int mother_base_id;
			int cluster_index;
		};

		struct CmdGetFobTargetListOption
		{
			char __pad0[40];
			fox::String msgid;
			char __pad1[32];
			fox::String type;
			int index;
			int num;
		};

		struct CmdSetSecurityChallengeOption
		{
			char __pad0[40];
			fox::String msgid;
			fox::String rqid;
			char __pad1[24];
			fox::String status;
		};

#define SHIFT_CONDITIONAL std::conditional<Shift == 16, fox::ncl::NclJsonMessageResult__shifted0x10, fox::ncl::NclJsonMessageResult>::type
#define SHIFT_CONDITIONAL_ASSERT static_assert(Shift == 16 || Shift == 0);

		template <size_t Shift>
		struct CmdSetSecurityChallengeResult : SHIFT_CONDITIONAL
		{
			SHIFT_CONDITIONAL_ASSERT
		};

		template <size_t Shift>
		struct CmdGetFobTargetListResult : SHIFT_CONDITIONAL
		{
			SHIFT_CONDITIONAL_ASSERT

			fox::String type;
			int target_num;
			int fogTargetListField24;
			FobTargetInfo targets[32];
			int target_count;
			int unk;
			int win;
			int lose;
			int esp_point;
			int event_point;
			int shield_date;
			int enable_security_challenge;
			FobDeployDamageParam fob_deploy_damage_param;
		};

		template <size_t Shift>
		struct CmdGetOwnFobListResult : SHIFT_CONDITIONAL
		{
			SHIFT_CONDITIONAL_ASSERT

			MotherBaseParam fob[4];
			int fob_count;
		};

		template <size_t Shift>
		struct CmdSyncResourceResult : SHIFT_CONDITIONAL
		{
			SHIFT_CONDITIONAL_ASSERT

			int diff_resource1[59];
			int diff_resource1_count;
			int diff_resource2[59];
			int diff_resource2_count;
			int fix_resource1[59];
			int fix_resource1_count;
			int fix_resource2[59];
			int fix_resource2_count;
		};

		static_assert(offsetof(CmdGetFobTargetListResult<16>, target_count) == 0xC0668);
		static_assert(offsetof(CmdGetFobTargetListResult<16>, enable_security_challenge) == 0xC0684);

		struct CmdGetFobTargetDetailResult
		{
			char __pad0[7144];
			std::uint64_t steam_id;
			char __pad1[8];
			fox::SharedString* ip;
			std::uint32_t port;
		};

		struct PlayerData
		{
			fox::String name;
			int play_time;
			int point;
			int league_grade;
			int league_rank;
			int fob_grade;
			int fob_rank;
			int fob_point;
			int espionage_win;
			int espionage_lose;
			int is_insurance;
			int index;
		};

		template <size_t Shift>
		struct CmdGetPlayerlistResult : SHIFT_CONDITIONAL
		{
			SHIFT_CONDITIONAL_ASSERT

			int player_num;
			int pad;
			PlayerData player_data[1];
			int count;
		};

		template <size_t Shift>
		struct CmdSetCurrentplayerResult : SHIFT_CONDITIONAL
		{
			SHIFT_CONDITIONAL_ASSERT

			int player_id;
		};

		struct CmdSyncMotherBaseOption
		{
			char __pad0[148];
			int mother_base_num;
			MotherBaseParam mother_base_param[4];
			int mother_base_count;
			char __pad1[380];
			int name_plate_id;
		};

		struct CmdSyncSoldierBinOption
		{
			char __pad0[136];
			mbm::impl::StaffControllerImpl::Staff soldier_param[3500];
			int soldier_num;
		};

		struct Daemon_sub_1_sub_1_sub2
		{
			steam_id steam_id;
			char name[0x81];
			char __pad0[39];
			bool logged_on;
		};

		struct Daemon_sub_1_sub_1_sub1_vftable
		{
			void* meth_1;
			void* meth_2;
			void* meth_3;
			void* meth_4;
			void* meth_5;
			void* meth_6;
			void* meth_7;
			void* meth_8;
			void* meth_9;
			void* meth_10;
		};

		struct Daemon_sub_1_sub_1_sub1
		{
			Daemon_sub_1_sub_1_sub1_vftable* __vftable;
		};

		struct Daemon_sub_1_sub_1
		{
			Daemon_sub_1_sub_1_sub1 inst;
			Daemon_sub_1_sub_1_sub2* ptr2;
		};

#pragma pack(push, 1)
		struct Daemon_sub_1
		{
			Daemon_sub_1_sub_1* ptr1;
			char __pad1[24];
			int state;
			char __pad2[5];
			char flags;
			char __pad3[2566];
			int unk1;
		};
#pragma pack(pop)

		struct FobP2pNameResolver
		{

		};

		struct Daemon
		{
			char __pad0[16];
			Daemon_sub_1* ptr1;
			char __pad1[56];
			int flags;
			FobP2pNameResolver* nameResolver;
		};

		struct NetworkInfo
		{
			char __pad0[161];
			char opponentName[32];
		};
	}

	static_assert(offsetof(tpp::net::CmdGetFobTargetDetailResult, steam_id) == 7144);
	static_assert(offsetof(tpp::net::CmdGetFobTargetDetailResult, ip) == 7160);
	static_assert(offsetof(tpp::net::CmdGetFobTargetDetailResult, port) == 7168);

	namespace tpp::ui::hud
	{
		struct AnnounceLogViewer
		{
			struct LogModel
			{
				bool initialized;
				char __pad0[7];
				fox::ui::Model* model;
				fox::ui::ModelNodeText* modelNodeText1;
				fox::ui::ModelNodeText* modelNodeText2;
				fox::ui::ModelNode* modelNode;
				fox::ui::ModelNodeMesh* modelNodeMesh;
				char __pad3[8];
				fox::ui::TextUnit textUnit;
			};

			void* a1;
			LogModel logModels[5];
		};
	}

	namespace tpp::gm
	{
		struct ScriptVars
		{
			char utcTime[8]; // 0
			char totalPlayTime[8]; // 8
			short locationCode; // 16
			short missionCode; // 18
			short prevLocationCode; // 20
			short prevMissionCode; // 22
			char __pad0[4];
			int rulesetDynamicPackIndices; // 28
			short mbLayoutCode; // 32
			char mbClusterId; // 34
			char fobSneakMode; // 35
			char fobIsSneak; // 36
			char fobIsEvent; // 37
			char fobIsSecurity; // 38
			char fobIsPlaceMode; // 39
			char fobIsInitializedFreePositionItem; // 40
			char __pad1[3];
			int returnStaffHeader; // 44
			int returnStaffSeeds; // 48
			int eulaVersion; // 52
			int eulaVersion2; // 56
			int eulaVersion3; // 60
			int countryIndex; // 64
			int countryStateIndex; // 68
			int infoId; // 72
			int infoIdForMGO; // 76
			int inquiryId; // 80
			int fobPickup; // 84
			int padType; // 88
			int clock; // 92
			char __pad2[4];
			int passageSecondsSinceOutMB; // 100
			int weather; // 104
			int weatherNextTime; // 108
			int extraWeatherInterval; // 112
			int weatherAddDensity; // 116
			char requestWeatherType[5]; // 120
			char __pad3[3];
			int requestWeatherUserId[5]; // 128
			int requestWeatherInterp[5]; // 148
			int requestWeatherParam[5]; // 168
			char dominatedCpFlagsAfgh[16]; // 188
			char dominatedCpFlagsMafr[16]; // 204
			int totalAlertCount; // 220
			int initialPlayerPosX; // 224
			int initialPlayerPosY; // 228
			int initialPlayerPosZ; // 232
			int playerPosX; // 236
			int playerPosY; // 240
			int playerPosZ; // 244
			char playerPartsType; // 248
			char playerCamoType; // 249
			char playerHandType; // 250
			char playerType; // 251
			short playerFaceId; // 252
			short playerFaceEquipId; // 254
			char playerSkillId; // 256
			char playerInjuryCount; // 257
			char playerBodyInjuryCount; // 258
			char __pad4[1];
			short playerLifeMax; // 260
			short initialPlayerRotY; // 262
			short playerRotY; // 264
			short initialPlayerFlag; // 266
			char initialPlayerAction; // 268
			char playerRetryFlag; // 269
			short initialPlayerPairGameObjectId; // 270
			short playerVehicleGameObjectId; // 272
			short initialPlayerVehicleGameObjectId; // 274
			short vehicleGameObjectIdOnPlayerOnCargo; // 276
			char __pad5[2];
			int playerDisableActionFlag; // 280
			short playerLife; // 284
			short playerStamina; // 286
			int playerCameraPosition[3]; // 288
			int playerCameraRotation[2]; // 300
			int playerStaffHeader; // 308
			int playerStaffSeed; // 312
			int playerPlayFlag; // 316
			int playerMarkingCountInMission; // 320
			int playerShootCountInMission; // 324
			int shootHitCountInMission; // 328
			int shootHitCountEliminatedInMission; // 332
			int playerOgrePointOnStartMission; // 336
			int playerRecoveryCountFromOgre; // 340
			int totalChickenCapTime; // 344
			int totalChickCapTime; // 348
			int totalDiscoveredCount; // 352
			int totalTakeHitCount; // 356
			int totalMovingDistanceAtStand; // 360
			int totalMovingDistanceAtSquat; // 364
			int totalMovingDistanceAtCrawl; // 368
			int totalMovingDistanceOnHorse; // 372
			int totalMovingDistanceOnVehicle; // 376
			int totalMovingDistanceOnWalkerGear; // 380
			int totalMovingDistanceOnBattleGear; // 384
			int totalMarkingCount; // 388
			int totalReflexCount; // 392
			char useBlackDiamondEmblem; // 396
			char isAvatarPlayerEnable; // 397
			char avatarFaceRaceIndex; // 398
			char avatarFaceTypeIndex; // 399
			char avatarFaceVariationIndex; // 400
			char avatarFaceColorIndex; // 401
			char avatarHairStyleIndex; // 402
			char avatarRightEyeColorIndex; // 403
			char avatarRightEyeBrightnessIndex; // 404
			char avatarLeftEyeColorIndex; // 405
			char avatarLeftEyeBrightnessIndex; // 406
			char avatarHairColor; // 407
			char avatarBerdStyle; // 408
			char avatarBerdLength; // 409
			char avatarEbrwStyle; // 410
			char avatarEbrwWide; // 411
			char avatarGashOrTatoVariationIndex; // 412
			char avatarTatoColorIndex; // 413
			char avatarAcceFlag; // 414
			char avatarMotionFrame[60]; // 415
			char avatarSaveIsValid; // 475
			char avatarEyePresetID; // 476
			char avatarNosePresetID; // 477
			char avatarMouthPresetID; // 478
			char avatarChinPresetID; // 479
			char avatarCheekPresetID; // 480
			char avatarEyebrowPresetID; // 481
			char avatarHeadPresetID; // 482
			char avatarHairPresetID; // 483
			char avatarHairColorPresetID; // 484
			char avatarSkinColorPresetID; // 485
			char avatarBeardPresetID; // 486
			char avatarAccessoryPresetID; // 487
			char avatarAllPartsPresetID; // 488
			char avatarReserve0; // 489
			char avatarReserve1; // 490
			char avatarReserve2; // 491
			char personalName[64]; // 492
			char personalBirthdayMonth; // 556
			char personalBirthdayDay; // 557
			char __pad6[2];
			int emblemTextureTag[4]; // 560
			int emblemColorL[4]; // 576
			int emblemColorH[4]; // 592
			char emblemX[4]; // 608
			char emblemY[4]; // 612
			char emblemScale[4]; // 616
			char emblemRotate[4]; // 620
			char emblemFlag[680]; // 624
			char emblemVersion; // 1304
			char emblemSyncFailed; // 1305
			char emblemSyncFailed2; // 1306
			char isServerDataCleared; // 1307
			char isDefaultDisconnected; // 1308
			char didCancelPatchDlcDownloadRequest; // 1309
			char didCancelFobPatchDlcDownloadRequest; // 1310
			char isPersonalDirty; // 1311
			short initWeapons[3]; // 1312
			short initSupportWeapons[8]; // 1318
			short initItems[8]; // 1334
			short initHandEquip; // 1350
			short weapons[6]; // 1352
			short ammoInWeapons[6]; // 1364
			short ammoSubInWeapons[6]; // 1376
			char suppressorLives[6]; // 1388
			char isUseSuppressor[6]; // 1394
			char isUseFlashLight[6]; // 1400
			char isInitialWeapon[6]; // 1406
			short supportWeapons[16]; // 1412
			short items[16]; // 1444
			char cboxPosterIndices[16]; // 1476
			short handEquip; // 1492
			char upgrades[16]; // 1494
			char ammoStockIds[46]; // 1510
			short ammoStockCounts[46]; // 1556
			int totalBatteryPowerAsGmp; // 1648
			int currentInventorySlot; // 1652
			int currentSupportWeaponIndex; // 1656
			int currentItemIndex; // 1660
			int fpsAttackMode; // 1664
			char currentZoomStep[5]; // 1668
			char requestFlagsAboutEquip; // 1673
			short weaponOriginalOwners[3]; // 1674
			char partsType2; // 1680
			char camoType2; // 1681
			char faceEquipId2; // 1682
			char __pad7[1];
			short weapons2[3]; // 1684
			short supportWeapons2[8]; // 1690
			short items2[8]; // 1706
			short handEquip2; // 1722
			char dirtyEffectCount[2]; // 1724
			char dirtyEffectBoneIndex[64]; // 1726
			char __pad8[2];
			int dirtyEffectPosition[192]; // 1792
			int dirtyEffectRadius[64]; // 2560
			short initCustomizedWeapon[3]; // 2816
			short customizedWeapon[3]; // 2822
			char initChimeraParts[36]; // 2828
			char chimeraParts[36]; // 2864
			char initChimeraPaintType[3]; // 2900
			char chimeraPaintType[3]; // 2903
			char initChimeraColorIndex[3]; // 2906
			char chimeraColorIndex[3]; // 2909
			char isUseCustomizedWeapon[3]; // 2912
			char customizedWeaponSlotIndex[3]; // 2915
			char itemLevels[72]; // 2918
			char itemLevelsDeveloped[72]; // 2990
			char developedItemLevels[72]; // 3062
			short suitDevelopLevel[117]; // 3134
			char initLoadoutInfo; // 3368
			char loadoutInfoSaveFormVersion; // 3369
			char loadoutInfoU8buf[460]; // 3370
			short loadoutInfoU16buf[144]; // 3830
			char __pad9[2];
			int loadoutInfoU32buf[68]; // 4120
			char currentLoadoutSlot; // 4392
			char sortieLoadoutInfoSaveFormVersion; // 4393
			char sortieLoadoutInfoU8buf[460]; // 4394
			short sortieLoadoutInfoU16buf[144]; // 4854
			char __pad10[2];
			int sortieLoadoutInfoU32buf[68]; // 5144
			char currentSortieLoadoutSlot; // 5416
			char currentSortieLoadoutSlotNonRental; // 5417
			char returnHeliLoadoutInfoSaveFormVersion; // 5418
			char returnHeliLoadoutInfoU8buf[460]; // 5419
			char __pad11[1];
			short returnHeliLoadoutInfoU16buf[144]; // 5880
			int returnHeliLoadoutInfoU32buf[68]; // 6168
			char currentReturnHeliLoadoutSlot; // 6440
			char currentForRentLoadoutSlotIndex; // 6441
			char __pad12[2];
			int rentalLoadoutPlayerId; // 6444
			char rentalLoadoutPlayerName[100]; // 6448
			char sortiePrepPlayerSnakePartsType; // 6548
			char sortiePrepPlayerSnakeCamoType; // 6549
			short sortiePrepPlayerSnakeFaceEquipId; // 6550
			char sortiePrepPlayerSnakeSuitLevel; // 6552
			char sortiePrepPlayerDDPartsType; // 6553
			char sortiePrepPlayerDDCamoType; // 6554
			char __pad13[1];
			short sortiePrepPlayerDDFaceEquipId; // 6556
			char sortiePrepPlayerDDSuitLevel; // 6558
			char sortiePrepPlayerType; // 6559
			int sortiePrepPlayerStaffHeader; // 6560
			int sortiePrepPlayerStaffSeed; // 6564
			int sortiePrepPlayerFaceId; // 6568
			short userPresetCustomizedWeapon[24]; // 6572
			char userPresetChimeraParts[288]; // 6620
			char userPresetChimeraColorIndex[24]; // 6908
			char userPresetChimeraPaintType[24]; // 6932
			char userPresetDWalkerParts[24]; // 6956
			char userPresetDWalkerPartsLevel[24]; // 6980
			char userPresetDWalkerAdditionalParts[12]; // 7004
			char userPresetDWalkerAdditionalPartsLevel[12]; // 7016
			char userPresetDWalkerCurrentSlot; // 7028
			char userPresetBattleGearParts[27]; // 7029
			char userPresetBattleGearPartsLevel[27]; // 7056
			char userPresetBattleGearCurrentSlot; // 7083
			char userPresetHeliParts[5]; // 7084
			char userPresetVehiclePaintType[10]; // 7089
			char userPresetBuddyDogParts[2]; // 7099
			char userPresetBuddyHorseParts[3]; // 7101
			char mbmUserPresetBaseColor; // 7104
			char __pad14[1];
			short droppedWeapons[3]; // 7106
			int droppedWeaponPos[9]; // 7112
			int droppedWeaponRot[12]; // 7148
			short droppedCount[6]; // 7196
			short droppedAmmo[6]; // 7208
			char droppedSuppressorLife[3]; // 7220
			char __pad15[1];
			short droppedCarrier[3]; // 7224
			char droppedCarrierPlaceNo[3]; // 7230
			char droppedWeaponStatus[3]; // 7233
			short importantItems[32]; // 7236
			short importantItemNumber[32]; // 7300
			int importantItemPos[96]; // 7364
			int importantItemRot[128]; // 7748
			char importantItemStatus[32]; // 8260
			int markingsOfPickable[33]; // 8292
			short missionCodeMarkingsOfPickable; // 8424
			char __pad16[2];
			int markingsOfPlaced[33]; // 8428
			short missionCodeMarkingsOfPlaced; // 8560
			short placedWeapons[32]; // 8562
			short placedOwnerIds[32]; // 8626
			char __pad17[2];
			int placedPos[96]; // 8692
			int placedRot[128]; // 9076
			int placedAttachTargetNames[64]; // 9588
			short placedAttachTargetIndex[32]; // 9844
			char placedAttachTargetGameObjectType[32]; // 9908
			int placedAttachPoints[64]; // 9940
			short placedCorrelationId[32]; // 10196
			short placedTargetGroupBlast[32]; // 10260
			char placedStatus[32]; // 10324
			short playerDecoyInstanceIndicies[12]; // 10356
			int playerDecoyAngleBallon[12]; // 10380
			short caputreAnimalId[16]; // 10428
			int captureAreaName[16]; // 10460
			char captureAnimalIndex; // 10524
			char __pad18[3];
			int collectionPositionsMoved[96]; // 10528
			int collectionRotationsMoved[32]; // 10912
			short collectionLocatorIndicesMoved[32]; // 11040
			int collectionMovedIndexEnd; // 11104
			short locationCodeOfCollectionMoved; // 11108
			char cboxIsValid[16]; // 11110
			char __pad19[2];
			int cboxLife[16]; // 11128
			short cboxFlag[16]; // 11192
			char cboxPosterType[16]; // 11224
			short cboxEquipId[16]; // 11240
			int cboxLocation[64]; // 11272
			char buddyTypeMissionStart; // 11528
			char obtainedBuddyTypeMissionStart; // 11529
			char sortieBuddyTypeMissionStart; // 11530
